{
  "data": [
    {
      "text": "Did you know that shutdowns actually spend more money than they save? Just recently, we have the longest shutdown in American history, lasting 43 days, and costing the taxpayer between $74 and $85 BILLION. This could all be changed with my Prevent Government Shutdowns Act, which",
      "created_at": "2026-02-06T17:52:23.000Z",
      "id": "2019831553245999396",
      "edit_history_tweet_ids": [
        "2019831553245999396"
      ]
    },
    {
      "text": "Join Cindy and me in prayer tonight for these two Okmulgee County Sheriff’s deputies. May God bring healing and peace to them, their families, and fellow officers. Thankful for those who answer the call to protect our communities. https://t.co/nS9y6aRlis",
      "created_at": "2026-02-06T01:24:20.000Z",
      "id": "2019582903827714120",
      "edit_history_tweet_ids": [
        "2019582903827714120"
      ]
    },
    {
      "text": "Over $120,000 sent to China for experiments on cute beagles! Apparently, we did not learn our lesson from Wuhan nearly 6 years ago. Conducting animal studies inside China raises serious concerns about transparency, biosafety, and data integrity, especially when U.S. taxpayer",
      "created_at": "2026-02-05T20:29:27.000Z",
      "id": "2019508692820144408",
      "edit_history_tweet_ids": [
        "2019508692820144408"
      ]
    },
    {
      "text": "Oklahoma already has voter ID laws, so it’s crazy to me that Democrats are trying to stop this. It seems they just want to continue ballot harvesting and fraud.\n \nLet’s fix this and have secure elections. https://t.co/lmtznOpQUT",
      "created_at": "2026-02-05T18:01:33.000Z",
      "id": "2019471471874134307",
      "edit_history_tweet_ids": [
        "2019471471874134307"
      ]
    },
    {
      "text": "Last year, we did more than point out the problems. We delivered real wins for taxpayers. Here are just a few touchdowns from the past year that @SenateGOP was able to accomplish ⬇️ https://t.co/mYEVN0RwYR",
      "created_at": "2026-02-05T16:34:03.000Z",
      "id": "2019449453220970950",
      "edit_history_tweet_ids": [
        "2019449453220970950"
      ]
    },
    {
      "created_at": "2026-02-05T00:35:31.000Z",
      "id": "2019208228635369671",
      "text": "I’m hosting a telephone town hall in 30 min. Be sure to tune in live on my Facebook!",
      "edit_history_tweet_ids": [
        "2019208228635369671"
      ]
    },
    {
      "created_at": "2026-02-04T22:42:12.000Z",
      "text": "It should boil your blood, @marc_lotter. American taxpayers do not want their money sent overseas for useless grants. https://t.co/yUG2AjBkmF",
      "edit_history_tweet_ids": [
        "2019179713743442022"
      ],
      "id": "2019179713743442022"
    },
    {
      "created_at": "2026-02-04T17:03:46.000Z",
      "text": "If a coach ran a team the way Washington is running the federal government, they’d be fired before halftime. The American taxpayer might be shocked by just how bad things really are. That’s why the latest edition of Federal Fumbles lays out the urgent playbook updates Congress https://t.co/O1ApPEpjoO",
      "edit_history_tweet_ids": [
        "2019094544227160319"
      ],
      "id": "2019094544227160319"
    },
    {
      "edit_history_tweet_ids": [
        "2020994215388578037"
      ],
      "created_at": "2026-02-09T22:52:23.000Z",
      "text": "Most of this week we’ll be working on finding a way to fund DHS and prevent another government shutdown. My Democrat colleagues are wanting to defund ICE, but what they don’t realize is that they are also defunding FEMA, TSA, and Coast Guard. Also, tune in on Thursday to see a https://t.co/oaeuChEiTs",
      "id": "2020994215388578037"
    },
    {
      "edit_history_tweet_ids": [
        "2020967506249383979"
      ],
      "created_at": "2026-02-09T21:06:15.000Z",
      "text": "The politically motivated 20-year sentence against Jimmy Lai is a direct assault on freedom and the rule of law in Hong Kong.\n \nJimmy Lai’s only “crime” is standing for a free press and the democratic rights Beijing promised to protect. The United States must stand firmly with",
      "id": "2020967506249383979"
    }
  ]
}