{
  "data": [
    {
      "edit_history_tweet_ids": [
        "2019868982501884342"
      ],
      "text": "Thank you to President Trump for taking down the post about the Obamas. He made significant inroads with his outreach in the African American community which we need to continue. His post sent the wrong message despite how it may have been originally intended.",
      "id": "2019868982501884342",
      "created_at": "2026-02-06T20:21:07.000Z"
    },
    {
      "edit_history_tweet_ids": [
        "2019847447091245496"
      ],
      "text": ".@jbletlow Where have you been on this? \n\n❌Backed Biden’s bill to give abortifacients to pregnant prisoners.\n❌ Stayed silent on FDA’s approval of mifepristone.\n❌ Stayed silent on chemical abortion drugs.\n\nI’m unapologetically pro-life. You’re not. https://t.co/9slqHAJgSP",
      "id": "2019847447091245496",
      "created_at": "2026-02-06T18:55:32.000Z"
    },
    {
      "text": "When fairness in women’s sports was on the line in Louisiana, I didn’t hesitate. Standing up for women’s athletics is about fairness, safety, and doing what’s right. Proud of what Louisiana conservatives delivered, and grateful for @BethMizell’s leadership and endorsement. https://t.co/1h7fyCfauM",
      "id": "2020876005179539726",
      "edit_history_tweet_ids": [
        "2020876005179539726"
      ],
      "created_at": "2026-02-09T15:02:40.000Z"
    },
    {
      "text": "Antisemitism is a real and serious threat affecting students and residents across New York City. @ZohranKMomdani’s decisions that weaken safeguards for Jewish students demand accountability. https://t.co/IptL4r4Qzj",
      "created_at": "2026-02-06T01:51:42.000Z",
      "id": "2019589787045482669",
      "edit_history_tweet_ids": [
        "2019589787045482669"
      ]
    },
    {
      "text": "Risk Rating 2.0 is hurting the pocketbooks of Louisiana families. While it affects homeowners across the country, it’s especially devastating here.\n\nI’m working with Senator @JohnKennedyLA to end this disastrous policy and make flood insurance affordable and accessible.",
      "created_at": "2026-02-05T22:49:05.000Z",
      "id": "2019543832740675705",
      "edit_history_tweet_ids": [
        "2019543832740675705"
      ]
    },
    {
      "text": "“I’m proud to endorse Senator Bill Cassidy, a conservative who has a long record of delivering real results for Louisiana. I’ve worked directly with him, and I can say from experience that he is always available and willing to help however he can. When our state needs leadership https://t.co/HMtDKORyF8",
      "created_at": "2026-02-05T18:35:52.000Z",
      "id": "2019480106335703506",
      "edit_history_tweet_ids": [
        "2019480106335703506"
      ]
    },
    {
      "text": "American elections belong to American citizens. 🗳️\n\nThat’s why I’m proud to be a co-sponsor of the SAVE Act, legislation that strengthens election integrity, ensures only citizens vote in our elections, and defends the foundation of our democracy.",
      "created_at": "2026-02-05T02:13:32.000Z",
      "id": "2019232896305758547",
      "edit_history_tweet_ids": [
        "2019232896305758547"
      ]
    },
    {
      "text": "Title IX is in place for a reason. Fairness and safety in women’s sports should never be up for debate.\nhttps://t.co/An3pFGNhQ5",
      "created_at": "2026-02-04T21:26:59.000Z",
      "id": "2019160782311944272",
      "edit_history_tweet_ids": [
        "2019160782311944272"
      ]
    },
    {
      "text": "https://t.co/k480LDAgVW",
      "created_at": "2026-02-04T17:58:29.000Z",
      "id": "2019108312021889237",
      "edit_history_tweet_ids": [
        "2019108312021889237"
      ]
    },
    {
      "text": "Common sense and science tell us there are two sexes—male and female. There isn’t a third option.\n\nAs Chair of the @GOPHELP, I’ve fought back against woke gender ideology and will continue to advocate for common sense policies that protect female athletes on and off the field. https://t.co/MXFm4PHAEx",
      "created_at": "2026-02-04T17:58:28.000Z",
      "id": "2019108309614092620",
      "edit_history_tweet_ids": [
        "2019108309614092620"
      ]
    }
  ]
}