{
  "data": [
    {
      "id": "2019984684080570385",
      "text": "@Sen_Alsobrooks The same people who sat idly while the Treasury was plundered through USAID and the parasitic NGOs?  Fire them all.",
      "edit_history_tweet_ids": [
        "2019984684080570385"
      ],
      "created_at": "2026-02-07T04:00:52.000Z"
    },
    {
      "id": "2019782073020486104",
      "text": "@Sen_Alsobrooks The scale of violence in Iran is staggering. With nearly 40,000 people killed and countless more systematic arrests and torture, the regime's brutality knows no bounds. The world cannot stay silent. #IranMassacre #IranRevolution2026 #R2PforIran",
      "edit_history_tweet_ids": [
        "2019782073020486104"
      ],
      "created_at": "2026-02-06T14:35:46.000Z"
    },
    {
      "id": "2019758788790595775",
      "text": "@Sen_Alsobrooks What a crock! To say that eliminating \"low performing Fed Workers\" is somehow going to diminish \"services\" to theAmerican people is a FLAT OUT LIE! Productive workers - just as in the Private Sector, have ZERO to worry about BUT those who aren't SHOULD be worried and/or fired!",
      "edit_history_tweet_ids": [
        "2019758788790595775"
      ],
      "created_at": "2026-02-06T13:03:15.000Z"
    },
    {
      "id": "2019680852893147421",
      "text": "@Sen_Alsobrooks If they choose to oppose the policy directives of the current administration (R or D), they deserve to go.",
      "edit_history_tweet_ids": [
        "2019680852893147421"
      ],
      "created_at": "2026-02-06T07:53:33.000Z"
    },
    {
      "id": "2019614071591436798",
      "text": "@_bled4dayz @Sen_Alsobrooks Preach https://t.co/5v2aVIlT28",
      "edit_history_tweet_ids": [
        "2019614071591436798"
      ],
      "created_at": "2026-02-06T03:28:11.000Z"
    },
    {
      "id": "2019610564423463409",
      "text": "@Sen_Alsobrooks Angela, you voted every time to keep the government shutdown down and federal workers to not get paid. GFY, after gerrymandering the state. We know who is doing the witch hunting. No integrity. Corrupt POS Marylanders are experiencing at the moment. https://t.co/33CpUjqKTP",
      "edit_history_tweet_ids": [
        "2019610564423463409"
      ],
      "created_at": "2026-02-06T03:14:15.000Z"
    },
    {
      "id": "2019567878064992638",
      "text": "@Sen_Alsobrooks She is a Govt check that does not have enough characters for a post explaining it fully as this is involving Senior Executives dealing with policy issues at the different agencies with the Civil Service system.",
      "edit_history_tweet_ids": [
        "2019567878064992638"
      ],
      "created_at": "2026-02-06T00:24:38.000Z"
    },
    {
      "id": "2019564515072045229",
      "text": "@Sen_Alsobrooks From someone who has only fed at the taxpayer trough your entire working life &amp; has no ability to fathom that employees can be fired - happens everyday in the real world &amp; it’s beyond time for massive firings in DC. #DrainTheSwamp #DOGENoVA #DOGEMD",
      "edit_history_tweet_ids": [
        "2019564515072045229"
      ],
      "created_at": "2026-02-06T00:11:16.000Z"
    },
    {
      "id": "2019553960441565589",
      "text": "@Sen_Alsobrooks Why does the federal government need 2.9 MILLION employees?????",
      "edit_history_tweet_ids": [
        "2019553960441565589"
      ],
      "created_at": "2026-02-05T23:29:20.000Z"
    },
    {
      "id": "2019547456770605450",
      "text": "@Sen_Alsobrooks The same standard of accountability that's typical in the private sector should be applied to the federal workforce, i.e., no sinecures for Democrat \"resistance\" activists. https://t.co/gi2vXrsh88",
      "edit_history_tweet_ids": [
        "2019547456770605450"
      ],
      "created_at": "2026-02-05T23:03:29.000Z"
    }
  ]
}