{
  "data": [
    {
      "id": "2018775866860359765",
      "created_at": "2026-02-03T19:57:28.000Z",
      "edit_history_tweet_ids": [
        "2018775866860359765"
      ],
      "text": "I had a great time at the Alaska Farm and Garden Show in Palmer, especially being able to present young Abby Raisanen with the Alaska Agricultural Youth Impact Award. \n\nAbby is an essential member of her family’s diversified farm operation that includes maintaining beehives, https://t.co/7tqQAhDK8Q"
    },
    {
      "id": "2018489110604714306",
      "created_at": "2026-02-03T00:58:00.000Z",
      "edit_history_tweet_ids": [
        "2018489110604714306"
      ],
      "text": "Taiwan’s legislature adjourned last week without passing the budget necessary for Taiwan to defend itself. Meantime, the leadership of the opposition party responsible for this, the KMT, is in Beijing meeting with the CCP and planning bigger engagements. It doesn’t take a genius"
    },
    {
      "id": "2018352666817228861",
      "created_at": "2026-02-02T15:55:49.000Z",
      "edit_history_tweet_ids": [
        "2018352666817228861"
      ],
      "text": "We need to continue to stand with the brave young men and women of Iran. The terrorist regime in Iran would be wise to heed the President’s warnings."
    },
    {
      "text": "The Alaska Jewish Campus’ Gan Yeladim Early Learning Center is initiating their Harmony Friendship Project which will establish Alaska’s first all-inclusive early childhood play center. Over half of Alaska is considered a child care desert, and I’ve worked in the Senate to expand https://t.co/vj7xNpjpyA",
      "created_at": "2026-02-01T21:42:04.000Z",
      "id": "2018077416544231789",
      "edit_history_tweet_ids": [
        "2018077416544231789"
      ]
    },
    {
      "edit_history_tweet_ids": [
        "2017407877976056087"
      ],
      "text": "It does not help our state or our country when our government is shut down, which is why I just voted to fund our government.\n\nThis bill increases pay for our troops, includes the Accelerating Kids’ Access to Care Act, which I co-sponsored, that helps young Alaskan with special https://t.co/6Cx3JbKvbo",
      "created_at": "2026-01-31T01:21:34.000Z",
      "id": "2017407877976056087"
    },
    {
      "text": "Today, I chaired a hearing on the @SenateCommerce  Subcommittee that oversees the @USCG. This hearing focused on the USCG’s presence in the Arctic and the progress being made on implementing the largest investment in USCG history—$25 billion—we secured in the budget https://t.co/XB2A1018zX",
      "edit_history_tweet_ids": [
        "2016991098141327471"
      ],
      "id": "2016991098141327471",
      "created_at": "2026-01-29T21:45:26.000Z"
    },
    {
      "id": "2019148194404610089",
      "edit_history_tweet_ids": [
        "2019148194404610089"
      ],
      "created_at": "2026-02-04T20:36:58.000Z",
      "text": "I was glad to visit TriJet as part of our Mat-Su Manufacturing Tour. TriJet supports other Alaska companies and start-ups with sophisticated, technology-based manufacturing. It’s amazing to see all this innovation happening right here in our great state! https://t.co/LL0e7jHQrn"
    },
    {
      "edit_history_tweet_ids": [
        "2019169796726911357"
      ],
      "id": "2019169796726911357",
      "created_at": "2026-02-04T22:02:48.000Z",
      "text": "Great news for Alaska! Today, in a strong bipartisan vote, the Senate today confirmed our state’s new federal judge, Aaron Peterson! A lifelong Alaskan, Aaron has extensive legal experience in our state spanning criminal prosecution, natural resources law, and national security. https://t.co/LZY6hht3cP"
    },
    {
      "created_at": "2026-02-06T19:09:01.000Z",
      "edit_history_tweet_ids": [
        "2019850836147617937"
      ],
      "text": "The post was offensive. I'm glad the White House took it down. https://t.co/5xEftJnvyN",
      "id": "2019850836147617937"
    },
    {
      "created_at": "2026-02-05T23:46:33.000Z",
      "edit_history_tweet_ids": [
        "2019558294030020674"
      ],
      "text": "The Bureau of Land Management’s announcement to hold the first oil and gas lease sale in the National Petroleum Reserve-Alaska since 2019 is great news for responsible resource development and hard-working Alaskans. I led bipartisan legislation overturning the Biden",
      "id": "2019558294030020674"
    }
  ]
}