{
  "data": [
    {
      "id": "2020190084700786830",
      "created_at": "2026-02-07T17:37:04.000Z",
      "text": "@SenatorLankford That’s not what it’s about James and you know it",
      "edit_history_tweet_ids": [
        "2020190084700786830"
      ]
    },
    {
      "id": "2020151617215967411",
      "created_at": "2026-02-07T15:04:12.000Z",
      "text": "@SenatorLankford Stfu you rino fucktarf. Yo know you will vote against.  But if the bill had billions of dollars going towards Israel you would vote for it",
      "edit_history_tweet_ids": [
        "2020151617215967411"
      ]
    },
    {
      "id": "2020041759296725055",
      "created_at": "2026-02-07T07:47:40.000Z",
      "text": "@SenatorLankford 🖕🏼u Lankford .. your a rino through n through .  Primaried in 26!!!!!!",
      "edit_history_tweet_ids": [
        "2020041759296725055"
      ]
    },
    {
      "id": "2019979352532988084",
      "created_at": "2026-02-07T03:39:41.000Z",
      "text": "@SenatorLankford Oklahoma has weak RINO senators.  Primary the out please",
      "edit_history_tweet_ids": [
        "2019979352532988084"
      ]
    },
    {
      "id": "2019976140262195264",
      "created_at": "2026-02-07T03:26:55.000Z",
      "text": "@SenatorLankford Pass the SAVE Act",
      "edit_history_tweet_ids": [
        "2019976140262195264"
      ]
    },
    {
      "id": "2019941872584757519",
      "created_at": "2026-02-07T01:10:45.000Z",
      "text": "@SenatorLankford Quit with SAVE Act scam. It’s not about ID, it’s about purging voter rolls and making it very difficult to register to vote. So much so that states won’t be able to meet the requirements for the midterms. WE ARE NOT DUMB. WE SEE YOUR PROPAGANDA https://t.co/IS7y9jwhUv",
      "edit_history_tweet_ids": [
        "2019941872584757519"
      ]
    },
    {
      "id": "2019941308798767558",
      "created_at": "2026-02-07T01:08:31.000Z",
      "text": "@SenatorLankford Y’all need to read the Epstein files. Shows Trump, Bannon, Epstein committed treason against the USA. Also, child rape and trafficking. Punishment for treason? Death, imprisonment, disqualification from holding office. The PEOPLE demand justice for Americans and for victims.",
      "edit_history_tweet_ids": [
        "2019941308798767558"
      ]
    },
    {
      "id": "2019922326788214915",
      "created_at": "2026-02-06T23:53:05.000Z",
      "text": "@SenatorLankford NOW IT HAS TO DO WITH YOUR 25 MILLION SLEEPER CELLS THAT YOU SAY WERE TO DO THE WORK AMERICANS WON'T DO. WAS THE TO KILL AMERICANS BECAUSE AMERICANS WON'T KILL EACH OTHER?\nPASS THE FUCKING SAVE ACT NOW, YOU FUCKS HAVE NOT ONE REASON WHY YOU SHOULDN'T BE DOING YOUR FUCKING JOB.",
      "edit_history_tweet_ids": [
        "2019922326788214915"
      ]
    },
    {
      "id": "2019921330641264801",
      "created_at": "2026-02-06T23:49:08.000Z",
      "text": "@SenatorLankford HEY DIPSTICK.\nTHEY GAVE REAL IDS TO THE ILLEGALS N MADE AMERICANS  \" MADE AMERICANS PROVE THEIR CITIZENSHIP TO GET OUR REAL IDS\" . OR DID YOU DEM'STHINK WE'D FUCKING FORGET THAT.\nMID 80'S YOU MADE EVERY AMERICAN SHOW A VALID SOCIAL SECURITY CARD TO WORK. BUT",
      "edit_history_tweet_ids": [
        "2019921330641264801"
      ]
    },
    {
      "id": "2019909148394066084",
      "created_at": "2026-02-06T23:00:43.000Z",
      "text": "@Soonergeddon @SenatorLankford 38 states already have the ID law. The problem is all the added items in this bill. To prove you’re a citizen you need to show your birth certificate the name on your birth certificate must match your identification. Women who take their husbands name will not have a matching ID.",
      "edit_history_tweet_ids": [
        "2019909148394066084"
      ]
    }
  ]
}