{
  "data": [
    {
      "created_at": "2026-02-06T21:06:48.000Z",
      "id": "2019880479605059963",
      "text": "The video has rightfully been removed from the President's social media. It should not have been posted in the first place. The content was racist and offensive and not who we are as a nation.",
      "edit_history_tweet_ids": [
        "2019880479605059963"
      ]
    },
    {
      "created_at": "2026-02-06T14:58:03.000Z",
      "id": "2019787679919923248",
      "text": ".@DeptVetAffairs National Cemetery Administration earned the highest customer satisfaction score achieved by any organization through the American Customer Satisfaction Index, under the leadership of @NCA_USMA. Thank you for all you do to serve our nation's veterans and their",
      "edit_history_tweet_ids": [
        "2019787679919923248"
      ]
    },
    {
      "id": "2019530509953462689",
      "text": "Great meeting with @SimplySorghum Leadership class members from KS this week. The participants were selected for this hands-on program to learn more about sorghum markets and how to expand them for producers. I appreciated learning about their experiences &amp; leadership in KS https://t.co/dP3FMDsbBh",
      "created_at": "2026-02-05T21:56:09.000Z",
      "edit_history_tweet_ids": [
        "2019530509953462689"
      ]
    },
    {
      "id": "2019489877335716095",
      "text": "Exciting news: Argentina has chosen Kansas City as its base camp for the 2026 @FIFAWorldCup! The team will be based in KC as they train &amp; their opening match will be at Arrowhead Stadium – drawing fans from around the globe. Welcome to the Heartland! https://t.co/BLEs3Pry4X",
      "created_at": "2026-02-05T19:14:41.000Z",
      "edit_history_tweet_ids": [
        "2019489877335716095"
      ]
    },
    {
      "id": "2019467522538369218",
      "text": "Yesterday, I introduced Robert Cekada, the President’s nominee to be the next @ATFHQ Director, during his hearing before @SenJudiciaryGOP. As Chairman of the subcommittee that funds the ATF, I’ve had the opportunity to get to know Rob in his current role as ATF Deputy Director, https://t.co/KWTNTS7m5z",
      "created_at": "2026-02-05T17:45:51.000Z",
      "edit_history_tweet_ids": [
        "2019467522538369218"
      ]
    },
    {
      "id": "2019425551010631941",
      "text": "Always great meeting with Kansan and @AmericanLegion National Commander Dan Wiley to discuss working together to keep improving care for our nation’s veterans. I look forward to his testimony before the House &amp; Senate Veterans’ Affairs Committees next month. https://t.co/ewW3WzgUH1",
      "created_at": "2026-02-05T14:59:05.000Z",
      "edit_history_tweet_ids": [
        "2019425551010631941"
      ]
    },
    {
      "id": "2020998396492865861",
      "text": "Veterans in Kansas and across the country deserve a coordinated, cohesive national strategy to make certain the programs, policies and legislation affecting their daily lives achieve their intended outcomes. https://t.co/PV3B8V9Bbj",
      "edit_history_tweet_ids": [
        "2020998396492865861"
      ],
      "created_at": "2026-02-09T23:09:00.000Z"
    },
    {
      "id": "2020965252544987438",
      "text": ".@KUHospital is conducting life-saving research to provide care for individuals in KS &amp; across the region. I helped secure federal resources for the new KU Cancer Center so it can continue to make a lasting difference in the lives of patients. https://t.co/Hv7HR3OnxC",
      "edit_history_tweet_ids": [
        "2020965252544987438"
      ],
      "created_at": "2026-02-09T20:57:18.000Z"
    },
    {
      "id": "2020914297602195727",
      "text": "✅SAF Coalition: https://t.co/W1kLlX22T6",
      "edit_history_tweet_ids": [
        "2020914297602195727"
      ],
      "created_at": "2026-02-09T17:34:49.000Z"
    },
    {
      "id": "2020914214211092573",
      "text": "✅Kansas Farm Bureau: https://t.co/MpiPIRw6cm",
      "edit_history_tweet_ids": [
        "2020914214211092573"
      ],
      "created_at": "2026-02-09T17:34:30.000Z"
    }
  ]
}