{
  "data": [
    {
      "edit_history_tweet_ids": [
        "2020317780386459658"
      ],
      "created_at": "2026-02-08T02:04:29.000Z",
      "text": "I’m relieved the Crespo-Gonzalez family has been released and returned to Oregon. As long as this Administration continues to detain our friends and neighbors without due process, we must all use our voices to defend common decency and the shared values that define us. \n\nWe",
      "id": "2020317780386459658"
    },
    {
      "edit_history_tweet_ids": [
        "2020254596372021434"
      ],
      "created_at": "2026-02-07T21:53:24.000Z",
      "text": "The Grifter-in-Chief is selling influence to line his own pockets. Corruption on full display.\n \nLet’s pass my End Crypto Corruption Act and STOP THE GRIFT!!! https://t.co/UWj0hbsxKq",
      "id": "2020254596372021434"
    },
    {
      "edit_history_tweet_ids": [
        "2019942304824365282"
      ],
      "created_at": "2026-02-07T01:12:28.000Z",
      "text": "The racist video of the Obamas shared by Trump is unacceptable any way you square it. It doesn’t matter what lies or justification the White House will come up with to try to smooth it over. It’s plainly indicative of the racist rot overtaking this administration.",
      "id": "2019942304824365282"
    },
    {
      "edit_history_tweet_ids": [
        "2019884388532605344"
      ],
      "created_at": "2026-02-06T21:22:20.000Z",
      "text": "If you value freedom and privacy, you should be against ICE weaponizing facial recognition tech to surveil us and terrorize our communities. \n\nWe need to get this tech out of Trump’s hands as he desperately tries to tighten his authoritarian grip. https://t.co/arR9KvmYYq",
      "id": "2019884388532605344"
    },
    {
      "edit_history_tweet_ids": [
        "2019865226079031593"
      ],
      "created_at": "2026-02-06T20:06:11.000Z",
      "text": "I’m fighting to protect our communities from Trump’s lawless federal agents. https://t.co/ghyMtyhgHg",
      "id": "2019865226079031593"
    },
    {
      "created_at": "2026-02-09T16:19:09.000Z",
      "id": "2020895252521877579",
      "text": "The American people need ALL of the Epstein Files to be released. Now.",
      "edit_history_tweet_ids": [
        "2020895252521877579"
      ]
    },
    {
      "created_at": "2026-02-09T14:01:23.000Z",
      "id": "2020860582702862407",
      "text": "China put Jimmy Lai through a sham trial in its quest to extinguish press freedom—Beijing is hell bent on trying to crush freedom of speech, but it will never succeed. The U.S. must continue to press for Jimmy’s release.\nhttps://t.co/nAdDb3qPSC",
      "edit_history_tweet_ids": [
        "2020860582702862407"
      ]
    },
    {
      "created_at": "2026-02-08T20:00:08.000Z",
      "id": "2020588479076618674",
      "text": "Great to speak with folks in Hood River, Wasco, and Clackamas counties during town halls. Thank you to everyone who shared their thoughts on how to make our state—and our country—a better place. https://t.co/s713EAo1A0",
      "edit_history_tweet_ids": [
        "2020588479076618674"
      ]
    },
    {
      "id": "2019542912611029383",
      "text": "People are dying in ICE detention and ICE is breaking the law to try to hide the details. It’s absolutely inexcusable.\n\nOne of Congress’s responsibilities is to conduct oversight—and unfortunately the House and Senate Republican majority has completely failed this responsibility.",
      "edit_history_tweet_ids": [
        "2019542912611029383"
      ],
      "created_at": "2026-02-05T22:45:26.000Z"
    },
    {
      "id": "2019504760492007877",
      "text": "The Grifter-in-Chief’s corruption on full display. \n\nI wrote the End Crypto Corruption Act to rein in this blatantly corrupt administration and stop any politician from cashing in on their position—we need to get it passed. https://t.co/tVh2Vbxunz",
      "edit_history_tweet_ids": [
        "2019504760492007877"
      ],
      "created_at": "2026-02-05T20:13:50.000Z"
    }
  ]
}