{
  "data": [
    {
      "text": "Health care in Colorado is in crisis. Costs are crushing families and straining our budget. \n\nAs governor, I’ll launch a first-ever Colorado public option so working people can get quality coverage they can afford.\n\n🔗 https://t.co/n54FYUUHwt https://t.co/giwViJoXth",
      "edit_history_tweet_ids": [
        "2018412264127123727"
      ],
      "id": "2018412264127123727",
      "created_at": "2026-02-02T19:52:38.000Z"
    },
    {
      "text": "Today I’m rolling out a cornerstone of my campaign: a plan to transform our health care system with a Colorado public option.\n\nI’m running for governor to take on health care costs and make quality coverage affordable for working Coloradans. https://t.co/hCtXY1BlN5",
      "edit_history_tweet_ids": [
        "2017383787156660270"
      ],
      "id": "2017383787156660270",
      "created_at": "2026-01-30T23:45:50.000Z"
    },
    {
      "text": "We need real limits, real oversight, and real consequences for Constitutional violations.\n\nAnd that starts with new leadership: Kristi Noem and Stephen Miller need to go. https://t.co/jPsN9KU10f",
      "edit_history_tweet_ids": [
        "2017314146774085951"
      ],
      "id": "2017314146774085951",
      "created_at": "2026-01-30T19:09:07.000Z"
    },
    {
      "created_at": "2026-02-05T16:51:51.000Z",
      "id": "2019453933026996522",
      "edit_history_tweet_ids": [
        "2019453933026996522"
      ],
      "text": "Colorado’s elections are the gold standard and I won’t let Trump sabotage them. \n\nAs your next governor, I’ll defend your vote. https://t.co/YXvVJnl6gn"
    },
    {
      "created_at": "2026-02-05T01:58:42.000Z",
      "id": "2019229162331075000",
      "edit_history_tweet_ids": [
        "2019229162331075000"
      ],
      "text": "Big news! Developers withdrew the Palmer Lake Buc-ee’s annexation bid.\n\nI pushed back early, calling this “flagpole annexation” a threat to the open spaces that define our state. Glad to see local voices stand strong. https://t.co/zXmIAViorp"
    },
    {
      "text": "Health care is a human right. I’ve always believed that.\n\nLet’s make that a reality here in Colorado. https://t.co/gDwCnAme5v",
      "created_at": "2026-02-06T19:05:51.000Z",
      "id": "2019850039607325017",
      "edit_history_tweet_ids": [
        "2019850039607325017"
      ]
    },
    {
      "edit_history_tweet_ids": [
        "2021289073772724610"
      ],
      "created_at": "2026-02-10T18:24:03.000Z",
      "id": "2021289073772724610",
      "text": "This weekend was jam-packed across Colorado but two stops said it all:\n\n🥫 Meet &amp; Greet at Good Shepherd Food Pantry about why I want to be your next governor and the fight ahead.\n🏠 Arvada Affordability Roundtable on what’s driving costs up and how I plan to address it. https://t.co/ADLVMbgXOh"
    }
  ]
}