{
  "data": [
    {
      "created_at": "2026-02-07T11:20:02.000Z",
      "id": "2020095201495380305",
      "text": "@SenTedBuddNC @SenateGOP https://t.co/9NMrFMuaFq",
      "edit_history_tweet_ids": [
        "2020095201495380305"
      ]
    },
    {
      "created_at": "2026-02-07T11:19:48.000Z",
      "id": "2020095143819506056",
      "text": "@SenTedBuddNC @SenateGOP Office of Personnel Management issued a final rule to STRIP civil service protections from 50,000 Fed employees, enabling the Trump Admin to replace nonpartisan civil servants hired for their skills with LOYALISTS. 94% of 40,000 public comments opposed the change. 5% support it https://t.co/1SQMDGdMR6",
      "edit_history_tweet_ids": [
        "2020095143819506056"
      ]
    },
    {
      "created_at": "2026-02-06T21:00:03.000Z",
      "id": "2019878781314560035",
      "text": "@SenTedBuddNC @SenateGOP Conservative are apparently sheep who don't know the difference between conservative principles and bastardized Democrat ones co-opted by the party",
      "edit_history_tweet_ids": [
        "2019878781314560035"
      ]
    },
    {
      "created_at": "2026-02-06T20:59:26.000Z",
      "id": "2019878624887992443",
      "text": "@SenTedBuddNC @SenateGOP Or Democrats to win an election outright without them\n\nAnd yet, the party continues to march towards the nearest cliff like a bunch of lemmings while screaming at Republicans not joining them that their RINOS, Liberals, or whatever else comes to mind since \"true\" modern",
      "edit_history_tweet_ids": [
        "2019878624887992443"
      ]
    },
    {
      "created_at": "2026-02-06T20:55:25.000Z",
      "id": "2019877616451510589",
      "text": "@SenTedBuddNC @SenateGOP Of course instead of taking the aspects that are reasonable and that most Americans would support I assume that it's safe to say that Republican politicians will continue to follow Trump off the cliff.\n\nIndependent voters determine elections. There aren't enough Republicans",
      "edit_history_tweet_ids": [
        "2019877616451510589"
      ]
    },
    {
      "created_at": "2026-02-06T20:38:47.000Z",
      "id": "2019873426794770596",
      "text": "@SenTedBuddNC @SenateGOP Hitler playbook. Dehumanize, destroy. \n\nDENOUNCE THIS.\nThis is yet another red line Trump has trampled on. \n\nDisgusting and intolerable racism.  \n\nThe old man is completely unhinged. https://t.co/6FIAFyt3rV",
      "edit_history_tweet_ids": [
        "2019873426794770596"
      ]
    },
    {
      "created_at": "2026-02-06T20:38:24.000Z",
      "id": "2019873331093336441",
      "text": "@SenTedBuddNC @SenateGOP Looks like you are conveniently ok with destroying the Constitution. Nauseated ex GOP here.\n\nNOOOOOOOOOOOO. No oversight, no warrants, gratuitous violence, no identification, no due process...\n\nEITHER ICE IS LAWFUL OR THEY ARE OUT...LIKE YOU WILL BE IN YOUR NEXT ELECTION. https://t.co/ULoW9XAk5x",
      "edit_history_tweet_ids": [
        "2019873331093336441"
      ]
    },
    {
      "created_at": "2026-02-06T19:34:57.000Z",
      "id": "2019857366142091649",
      "text": "@SenTedBuddNC STOP the McConnell Coup. He's a bitter old woman,who holds a grudge. Men don't do that. Thune &amp; Grassley &amp; McConnell &amp; the NEVER TRUMPERS in Leadership are ENEMIES OF THE REPUBLIC. You know it, I know it,the entire Nation knows it. https://t.co/faywEhSvJc",
      "edit_history_tweet_ids": [
        "2019857366142091649"
      ]
    },
    {
      "created_at": "2026-02-06T18:11:22.000Z",
      "id": "2019836328893206557",
      "text": "@SenTedBuddNC Try saying no. If standing up means shutting down the government, fine.",
      "edit_history_tweet_ids": [
        "2019836328893206557"
      ]
    },
    {
      "created_at": "2026-02-06T17:45:28.000Z",
      "id": "2019829810240049191",
      "text": "@SenTedBuddNC Senator, the way to deal with these people is to release a list of counterpoints that your base wants and fight like hell for them.  Not complain about what the other side is demanding.  Whip the Save America Act votes &amp; put it to filibuster.  Dems fear having to defend that!",
      "edit_history_tweet_ids": [
        "2019829810240049191"
      ]
    }
  ]
}