{
  "data": [
    {
      "id": "2020264218596110790",
      "text": "@ChrisVanHollen 🤡",
      "edit_history_tweet_ids": [
        "2020264218596110790"
      ],
      "created_at": "2026-02-07T22:31:39.000Z"
    },
    {
      "id": "2020258902890180795",
      "text": "@ChrisVanHollen Too bad he wasn't arrested when he destroyed a federal agents car. He could have been alive today",
      "edit_history_tweet_ids": [
        "2020258902890180795"
      ],
      "created_at": "2026-02-07T22:10:31.000Z"
    },
    {
      "id": "2020254507326926960",
      "text": "@ChrisVanHollen The gun went off on its own. Are you all that retarded? This has been an ongoing issue with that particular model of firearm for the longest time. So many police departments ban its use on the field for that particular reason.",
      "edit_history_tweet_ids": [
        "2020254507326926960"
      ],
      "created_at": "2026-02-07T21:53:03.000Z"
    },
    {
      "id": "2020248138372772052",
      "text": "@ChrisVanHollen So... it's been reported numerous times that you must have your ID to legally carry there... He did not, so it was illegal for him to be carrying. Does your credibility matter, when you fail to provide all the facts, either due to incompetence or lack of integrity?",
      "edit_history_tweet_ids": [
        "2020248138372772052"
      ],
      "created_at": "2026-02-07T21:27:45.000Z"
    },
    {
      "id": "2020229052393492654",
      "text": "@ChrisVanHollen Can not wait till you announce your run for president. The new Hollen-Dani of the presidential race.",
      "edit_history_tweet_ids": [
        "2020229052393492654"
      ],
      "created_at": "2026-02-07T20:11:54.000Z"
    },
    {
      "id": "2020227135844319680",
      "text": "@Iammurphycolet @ChrisVanHollen Blame the murder victim and let’s give a Trump Medal of (dis)Honor to the murderers and a Kyle Rittenhouse bumper sticker to all the MAGA imbeciles who cheer this American atrocity.",
      "edit_history_tweet_ids": [
        "2020227135844319680"
      ],
      "created_at": "2026-02-07T20:04:17.000Z"
    },
    {
      "id": "2020225911635996935",
      "text": "@ChrisVanHollen It’s always good to see Chris taking the side of the lawbreakers. You’re in the federal government; you’re supposed to be in favor of enforcing federal laws. Go have a margarita with your boyfriend from El Salvador. Sorry, I meant “Maryland Man”!",
      "edit_history_tweet_ids": [
        "2020225911635996935"
      ],
      "created_at": "2026-02-07T19:59:25.000Z"
    },
    {
      "id": "2020213906505916453",
      "text": "@ChrisVanHollen Because Dems have no solutions after Biden’s open borders debacle they crudely lie, distort facts. What SANE person would embrace pedophiles, rapists, murderers, traffickers, drug dealers? No one can justify. Their HATE SPEECH causes assassination attempts: Trump, Cavanaugh, Kirk",
      "edit_history_tweet_ids": [
        "2020213906505916453"
      ],
      "created_at": "2026-02-07T19:11:43.000Z"
    },
    {
      "id": "2020204248324272567",
      "text": "@ChrisVanHollen Pretti was a professional activist. Once before he obstructed ICE spit at their vehicle and kicked out the tail light while he had a loaded gun. Again, he had a loaded gun two loaded clips no ID no permit to carry on him. He interfered with ICE again, and unfortunately, he died.",
      "edit_history_tweet_ids": [
        "2020204248324272567"
      ],
      "created_at": "2026-02-07T18:33:21.000Z"
    },
    {
      "id": "2020202997490532582",
      "text": "@ChrisVanHollen Freddie was a fucking loser carrying a gun to a protest against the law didn’t have a job was a piece of shit nurse and now he’s dead so fucking what",
      "edit_history_tweet_ids": [
        "2020202997490532582"
      ],
      "created_at": "2026-02-07T18:28:22.000Z"
    }
  ]
}