{
  "data": [
    {
      "id": "2020167884018979197",
      "text": "Grateful to participate in the Congressional Research Service speaker series. The talented staff at CRS provides vital research to Members of Congress. Thank you to the entire CRS team for all you do! https://t.co/W96qivR2w3",
      "edit_history_tweet_ids": [
        "2020167884018979197"
      ],
      "created_at": "2026-02-07T16:08:51.000Z"
    },
    {
      "id": "2019855744141529207",
      "text": "Howard County has made its stance clear: when it comes to ICE’s inhumane detention centers, the answer is no and hell no.\n\nToday, County Executive Calvin Ball signed emergency legislation revoking the building permit for a privately owned ICE detention facility whose owners https://t.co/TrqNU8bQcD",
      "edit_history_tweet_ids": [
        "2019855744141529207"
      ],
      "created_at": "2026-02-06T19:28:31.000Z"
    },
    {
      "text": "Honored to join the National Black Nurses Association Day on Capitol Hill. Your advocacy for patients, equity, and a stronger nursing workforce is powerful and it’s being heard. I’m proud to stand with you in this fight for equity in health care. https://t.co/eJSQ1CDoNi",
      "created_at": "2026-02-05T23:48:03.000Z",
      "edit_history_tweet_ids": [
        "2019558669801935189"
      ],
      "id": "2019558669801935189"
    },
    {
      "text": "This Administration inherited a strong economy and is doing what they do best, running it into the ground. https://t.co/1xB9n0Di0V",
      "created_at": "2026-02-05T22:56:49.000Z",
      "edit_history_tweet_ids": [
        "2019545777127976981"
      ],
      "id": "2019545777127976981"
    },
    {
      "text": "The witch hunt for federal workers continues.\n\nThe American people will suffer thanks to this Administration's callous treatment of the very people who make sure our seniors get their Social Security, that our food and water are safe, and more. https://t.co/MGIEjWQGbZ",
      "created_at": "2026-02-05T16:38:34.000Z",
      "edit_history_tweet_ids": [
        "2019450586769273227"
      ],
      "id": "2019450586769273227"
    },
    {
      "edit_history_tweet_ids": [
        "2020939416639004991"
      ],
      "created_at": "2026-02-09T19:14:38.000Z",
      "text": "With the competition underway in Milano Cortina, I am excited to cheer on @TeamUSA, especially the Marylanders competing!\n\nhttps://t.co/349ltIyeFm",
      "id": "2020939416639004991"
    },
    {
      "edit_history_tweet_ids": [
        "2020624034153849013"
      ],
      "created_at": "2026-02-08T22:21:25.000Z",
      "text": "A wonderful service and sermon for Divine 9 Day at Greater Mt. Nebo AME this morning. Guest speaker Rev. Dr. Gwendolyn Boyd delivered a powerful message about the strength in unity. https://t.co/thzV2LyrCX",
      "id": "2020624034153849013"
    },
    {
      "created_at": "2026-02-04T19:50:59.000Z",
      "id": "2019136624278561189",
      "text": "Today, we honor Rosa Parks on what would have been her 113th birthday. In refusing to give up her seat on a Montgomery bus, Ms. Parks propelled the Civil Rights movement forward.\n\nMay her bravery continue to inspire us all to keep pushing for a nation with justice for all. https://t.co/Y397qbpznw",
      "edit_history_tweet_ids": [
        "2019136624278561189"
      ]
    },
    {
      "created_at": "2026-02-04T18:49:51.000Z",
      "id": "2019121238417797599",
      "text": "Journalists hold power accountable, and this is NOT the time for sweeping layoffs.\n\nWhen newsrooms like the Washington Post shrink, our democracy suffers.\n\nIt’s hard to hold power to account when you’ve laid off hundreds of staffers. https://t.co/EMVYR0fihE",
      "edit_history_tweet_ids": [
        "2019121238417797599"
      ]
    },
    {
      "created_at": "2026-02-04T18:05:24.000Z",
      "id": "2019110052330958872",
      "text": "As a former Prince George's County State’s Attorney, it was great to meet with State’s Attorneys from across Maryland alongside @ChrisVanHollen.\n\nWe discussed supporting victims, the opioid crisis, online child safety, and addressing workforce challenges in prosecutors’ offices. https://t.co/jvKHrk3wxn",
      "edit_history_tweet_ids": [
        "2019110052330958872"
      ]
    }
  ]
}