{
  "data": [
    {
      "edit_history_tweet_ids": [
        "2020574338974707742"
      ],
      "text": "First responders step up to help our communities during our toughest times, and it's up to us to make sure they have the mental health resources they need.\n\nGrateful to join Andy Ansbro and Friends of Firefighters in Brooklyn yesterday to celebrate new funding we've secured for https://t.co/TagWI8GW9I",
      "created_at": "2026-02-08T19:03:57.000Z",
      "id": "2020574338974707742"
    },
    {
      "edit_history_tweet_ids": [
        "2020230139540345212"
      ],
      "text": "Last night’s court ruling confirms what we already knew: President Trump must put the American people over his ego and stop playing games with New Yorkers’ tax dollars and livelihoods.\n\nHundreds of thousands of Americans are counting on the Gateway Hudson Tunnel – including the https://t.co/CXrh9L5n2k",
      "created_at": "2026-02-07T20:16:13.000Z",
      "id": "2020230139540345212"
    },
    {
      "id": "2020903263348858997",
      "text": "I was glad to visit the Masjid As-Salam Community Center in Brooklyn to meet with community members and make clear that anti-Muslim violence has absolutely no place in our city.\n\nThank you to APNA Brooklyn Community Center and Erum Hanif for inviting me! https://t.co/rdSwp0WXqC",
      "edit_history_tweet_ids": [
        "2020903263348858997"
      ],
      "created_at": "2026-02-09T16:50:59.000Z"
    },
    {
      "text": "Grateful to co-chair the National Prayer Breakfast with @RogerMarshallMD yesterday morning!\n\nEven when we are separated by policy and politics, we are united in our faith; faith in God, faith in our country, and faith that we can come together to improve the lives of the American https://t.co/QEibnQMWeD",
      "id": "2019823985333076270",
      "created_at": "2026-02-06T17:22:19.000Z",
      "edit_history_tweet_ids": [
        "2019823985333076270"
      ]
    },
    {
      "text": "No. This is ridiculous. These naming rights aren’t tradable as part of any negotiations, and neither is the dignity of New Yorkers. At a time when New Yorkers are already being crushed by high costs under the Trump tariffs, the president continues to put his own narcissism over https://t.co/eavU6jy62f",
      "id": "2019595570030031179",
      "created_at": "2026-02-06T02:14:40.000Z",
      "edit_history_tweet_ids": [
        "2019595570030031179"
      ]
    },
    {
      "text": "After Senate Democrats stripped funding for ICE out of the appropriations bill, we were able to secure billions of dollars for the programs and services New Yorkers rely on. \n\nHere are 5 wins for New York families should know about: https://t.co/9n5NezR6c5",
      "id": "2019552844471488512",
      "created_at": "2026-02-05T23:24:54.000Z",
      "edit_history_tweet_ids": [
        "2019552844471488512"
      ]
    },
    {
      "text": "I am angered by the Islamophobic attacks that took place in South Brooklyn. Our Muslim neighbors deserve to feel safe practicing and wearing articles of their faith in the city they call home.\nhttps://t.co/wJ5OPLcekP",
      "id": "2019396611437437030",
      "created_at": "2026-02-05T13:04:05.000Z",
      "edit_history_tweet_ids": [
        "2019396611437437030"
      ]
    },
    {
      "id": "2019903240142242250",
      "created_at": "2026-02-06T22:37:15.000Z",
      "text": "The World Trade Center Health Program is more than just a health care program. It is the fulfillment of a debt owed to those who gave their all for us.\n\nBy doing our duty and fully funding the World Trade Center Health Program, we honor the very best in America.\n\nIn fulfilling https://t.co/FM9f3frRuU",
      "edit_history_tweet_ids": [
        "2019903240142242250"
      ]
    },
    {
      "id": "2019158055586570406",
      "text": "It's time for Trump to stop playing political games with our workers and our economy.\n\nHe must release federal funding – paid for by taxpayers, including New Yorkers – for the Hudson Tunnel Gateway Project before construction is forced to stop. https://t.co/iMudyENG62",
      "edit_history_tweet_ids": [
        "2019158055586570406"
      ],
      "created_at": "2026-02-04T21:16:09.000Z"
    },
    {
      "text": "Grateful to join members of the Oneida Indian Nation to honor Polly Cooper, an Oneida woman who helped feed Washington’s army at Valley Forge in a true act of friendship and alliance.\n\nI look forward to seeing Polly's heroism featured on U.S. Mint’s 2026 Native American $1 Coin. https://t.co/IpQDoVsG3W",
      "id": "2020924558186803262",
      "created_at": "2026-02-09T18:15:36.000Z",
      "edit_history_tweet_ids": [
        "2020924558186803262"
      ]
    }
  ]
}