{
  "data": [
    {
      "created_at": "2026-02-08T20:34:34.000Z",
      "edit_history_tweet_ids": [
        "2020597143317172554"
      ],
      "text": "@9thGenTN @MarshaBlackburn I don’t believe about the grabbing comment because I listened to the tape with my own ears. So he said what he said, but he didn’t say he actually did it. He was making a point about how disgusting some women are when it comes to rich and famous men. And he was right. And as far",
      "id": "2020597143317172554"
    },
    {
      "created_at": "2026-02-08T20:25:23.000Z",
      "edit_history_tweet_ids": [
        "2020594830200512706"
      ],
      "text": "@9thGenTN @MarshaBlackburn Site your work. Tell me where he violates anybody’s for a second and fourth amendment. And let’s compare it to what Joe Biden did for four years. I’ll beat you hands-down, every single time but by all means site your work.",
      "id": "2020594830200512706"
    },
    {
      "created_at": "2026-02-08T20:03:54.000Z",
      "edit_history_tweet_ids": [
        "2020589426414702966"
      ],
      "text": "@Lisa191016 @MarshaBlackburn Oh wait I missed the preserve the Constitution comment! Hilarious that u cite that when they are openly violating people’s 1st, 2nd &amp; 4th amendments. Live in your fairly tale land right up until his goin squad knocks on your door! Done with this convo.",
      "id": "2020589426414702966"
    },
    {
      "created_at": "2026-02-08T20:00:45.000Z",
      "edit_history_tweet_ids": [
        "2020588634231968233"
      ],
      "text": "@Lisa191016 @MarshaBlackburn So you don’t believe anything you don’t want to believe; court results, him saying  he said the grabbing comment, other women who have been saying FOR YEARS that he assaulted them none of it. Bet u think the J6ers were just touring the Capitol too. The delusion is astounding!",
      "id": "2020588634231968233"
    },
    {
      "created_at": "2026-02-08T19:34:56.000Z",
      "edit_history_tweet_ids": [
        "2020582134638092511"
      ],
      "text": "@9thGenTN @MarshaBlackburn As a matter of fact, he has never admitted to any of that, yes, he did cheat on his wives and I don’t condone that but that’s something he’ll have to deal with, it’s not the first time and it won’t be the last time that a man cheated on his wife, or a wife in a husband. But all",
      "id": "2020582134638092511"
    },
    {
      "created_at": "2026-02-08T19:33:30.000Z",
      "edit_history_tweet_ids": [
        "2020581775517663376"
      ],
      "text": "@MarshaBlackburn Why do you defend this guy?  He makes almost all of us embarrassed to be Americans. Not to mention this: https://t.co/pSYXeh4xM9",
      "id": "2020581775517663376"
    },
    {
      "created_at": "2026-02-08T19:15:28.000Z",
      "edit_history_tweet_ids": [
        "2020577235690774999"
      ],
      "text": "@Lisa191016 @MarshaBlackburn Awe bless your heart! He’s acknowledged the martial infidelity, the lawsuits over unpaid service from contractors is public record as is the stealing from his charity and I’ve heard, &amp; he’s acknowledged the genitalia grabbing tape so who’s the brainwashed one here?",
      "id": "2020577235690774999"
    },
    {
      "created_at": "2026-02-08T19:14:52.000Z",
      "edit_history_tweet_ids": [
        "2020577085115564323"
      ],
      "text": "@MarshaBlackburn @FBIDirectorKash Hey Senator, wasn't the incident on January 6 against Americans on American soil?? Weren't all thise found guilty released from prison by Trump?",
      "id": "2020577085115564323"
    },
    {
      "created_at": "2026-02-08T19:07:17.000Z",
      "edit_history_tweet_ids": [
        "2020575177218703744"
      ],
      "text": "@9thGenTN @MarshaBlackburn All of that is what they fed you and being a moron you believed it. Sorry. But true. So you do you. I choose to believe and you choose hate. Let me know how that works out for ya.",
      "id": "2020575177218703744"
    },
    {
      "created_at": "2026-02-08T19:02:55.000Z",
      "edit_history_tweet_ids": [
        "2020574076830687431"
      ],
      "text": "@Lisa191016 @MarshaBlackburn The fact that u believe a man who cheated on every wife, cheated in business, stole from a charity, said he grabs women by their genitalia &amp; mocks the disabled says it all. No need for me to further waste my time. https://t.co/F77wKEVL9L",
      "id": "2020574076830687431"
    }
  ]
}