{
  "data": [
    {
      "created_at": "2026-02-05T23:00:51.000Z",
      "text": "No one wants criminals in our communities – and we should be able to trust that law enforcement is focused on getting them off the streets.\n\nWhen ICE goes after law-abiding folks, they’re not making our communities any safer. That’s why we need to ensure agents have proper",
      "edit_history_tweet_ids": [
        "2019546791247548626"
      ],
      "id": "2019546791247548626"
    },
    {
      "created_at": "2026-02-05T01:07:17.000Z",
      "text": "Interns in my office have the opportunity to learn about the legislative process, constituent services, and much more. We offer internships in Las Vegas, Reno, and DC!\n\nThe deadline to apply for a paid summer internship is March 1. Apply here: https://t.co/9hLxO7rx7K",
      "edit_history_tweet_ids": [
        "2019216221368111531"
      ],
      "id": "2019216221368111531"
    },
    {
      "created_at": "2026-02-04T18:52:43.000Z",
      "text": "Read more: https://t.co/HK2CZDB5wX",
      "edit_history_tweet_ids": [
        "2019121960723316828"
      ],
      "id": "2019121960723316828"
    },
    {
      "created_at": "2026-02-04T18:52:42.000Z",
      "text": "We can’t have someone enforcing the law who isn’t even following the law himself. The American people deserve to know if Tom Homan took $50k from an FBI undercover agent and what he did with the money. https://t.co/3jZYDTQVr9",
      "edit_history_tweet_ids": [
        "2019121958198358329"
      ],
      "id": "2019121958198358329"
    },
    {
      "id": "2019897034518528171",
      "edit_history_tweet_ids": [
        "2019897034518528171"
      ],
      "created_at": "2026-02-06T22:12:35.000Z",
      "text": "From the U.S. Army to the Nevada State Legislature to U.S. Congress, Rep. Amodei has dedicated his life to serving Nevada and our nation. While we come from different parties and different backgrounds, I've always been grateful to have been able to work across the aisle with him https://t.co/keZbTrDWGb"
    },
    {
      "id": "2019804479491821708",
      "edit_history_tweet_ids": [
        "2019804479491821708"
      ],
      "created_at": "2026-02-06T16:04:48.000Z",
      "text": "Glad to welcome Nevadans to the U.S. Senate for @SenCortezMasto and my first Battle Born Breakfast of 2026! https://t.co/NRRvOALRxc"
    },
    {
      "created_at": "2026-02-08T20:50:02.000Z",
      "edit_history_tweet_ids": [
        "2020601033685389569"
      ],
      "text": "Team Rosen was proud to join @WillMcCurdyII to light up the Las Vegas sign red, black, and green in honor of Black History Month! https://t.co/6kshyA38fY",
      "id": "2020601033685389569"
    },
    {
      "created_at": "2026-02-07T21:02:16.000Z",
      "edit_history_tweet_ids": [
        "2020241725600772157"
      ],
      "text": "The average first time homebuyer today is 40 years old. It shouldn’t be this hard for young people to afford a place to live and start a family.\n\nWe need to do more to increase our housing supply and make sure units are affordable and available to real people – not bad actor",
      "id": "2020241725600772157"
    },
    {
      "id": "2020687166784073742",
      "created_at": "2026-02-09T02:32:17.000Z",
      "text": ".@sanbenito representa los “estándares de éxito, creatividad y excelencia” de Estados Unidos mucho más que Donald Trump. https://t.co/Ss13hr59Y9",
      "edit_history_tweet_ids": [
        "2020687166784073742"
      ]
    },
    {
      "id": "2020686790223409593",
      "created_at": "2026-02-09T02:30:47.000Z",
      "text": ".@sanbenito represents America’s “standards of success, creativity, &amp; excellence” more than Donald Trump ever has. https://t.co/Ss13hr4C8B",
      "edit_history_tweet_ids": [
        "2020686790223409593"
      ]
    }
  ]
}