{
  "data": [
    {
      "id": "2018435577364783580",
      "created_at": "2026-02-02T21:25:17.000Z",
      "edit_history_tweet_ids": [
        "2018435577364783580"
      ],
      "text": "Trump promised to bring back manufacturing jobs. He did the opposite. https://t.co/8nduTEu8rj"
    },
    {
      "id": "2018434108867637523",
      "created_at": "2026-02-02T21:19:26.000Z",
      "edit_history_tweet_ids": [
        "2018434108867637523"
      ],
      "text": "Black History Month is a reminder that progress only happens when people refuse to accept injustice as normal. We honor that legacy by continuing that work today and every day. https://t.co/fn5q7Nq9oJ"
    },
    {
      "text": "The best version of this country is one where everyone gets a fair shot, no matter where they start in life. Where families can walk their streets without fear. Where the son of immigrants can grow up to serve as a United States Senator.\n\nThat’s the America worth fighting for. https://t.co/lP8StzgzjN",
      "created_at": "2026-01-31T16:51:09.000Z",
      "id": "2017641816489697512",
      "edit_history_tweet_ids": [
        "2017641816489697512"
      ]
    },
    {
      "text": "We know what happens when law enforcement is empowered to target people for the color of their skin. Arizona has seen it before. If ICE isn’t brought under control, we’ll see it again. https://t.co/vDCFbY7GSM",
      "created_at": "2026-01-31T01:43:11.000Z",
      "id": "2017413318026117338",
      "edit_history_tweet_ids": [
        "2017413318026117338"
      ]
    },
    {
      "text": "Just joined the Don Lemon show live from the Capitol to stand with him and every journalist putting themselves on the front lines. \n\nThis is not normal. In America, we don’t arrest journalists for telling the truth. https://t.co/p9myKzuDeg",
      "created_at": "2026-01-30T22:46:01.000Z",
      "id": "2017368734483018118",
      "edit_history_tweet_ids": [
        "2017368734483018118"
      ]
    },
    {
      "text": "I’m voting NO. \n\nI will not give ICE one more dime without real, meaningful reform on paper. Two American citizens were killed at point blank in less than one month because ICE was given a slush fund and a blank check to act without accountability. I won’t fund Trump’s private",
      "created_at": "2026-01-30T21:03:11.000Z",
      "id": "2017342855048482987",
      "edit_history_tweet_ids": [
        "2017342855048482987"
      ]
    },
    {
      "text": "I was just talking to Don Lemon on Monday. He’s doing what journalists are supposed to do: asking questions and speaking truth. In the past week this Administration has now blown through the First, Second, and Fourth amendment in Minneapolis. We can't let this government trample https://t.co/d9ogmkNsJF",
      "created_at": "2026-01-30T16:33:02.000Z",
      "id": "2017274867419107651",
      "edit_history_tweet_ids": [
        "2017274867419107651"
      ]
    },
    {
      "edit_history_tweet_ids": [
        "2018821716240196082"
      ],
      "created_at": "2026-02-03T22:59:39.000Z",
      "id": "2018821716240196082",
      "text": "Rebuilding the middle class starts with families.\n\nThe Strong Start Act gives parents $3,000 when their baby is born and sets every child up with a $1,000 bond that will grow over their lifetime that they can cash in when they’re 18. It’s about helping families stay afloat early https://t.co/DHfUpIqo4W"
    },
    {
      "edit_history_tweet_ids": [
        "2018763554132783573"
      ],
      "created_at": "2026-02-03T19:08:32.000Z",
      "id": "2018763554132783573",
      "text": "Fixed it for you @MELANIATRUMP https://t.co/fJdaAjHfTu"
    },
    {
      "edit_history_tweet_ids": [
        "2018748642107199757"
      ],
      "created_at": "2026-02-03T18:09:17.000Z",
      "id": "2018748642107199757",
      "text": "Now is not the time to weaken Taiwan’s defenses. Cutting their defense budget undermines investments in essential weapons systems just as China’s threats are intensifying. Taiwan’s parliament should reconsider this move. https://t.co/DFALiMs4ZQ"
    }
  ]
}