{
  "data": [
    {
      "text": "Great meeting with labor leaders in Duluth today. As I said to them, when unions are strong, our economy is strong. And when our economy is strong, Minnesota is strong. https://t.co/WsytFuImP3",
      "created_at": "2026-02-07T01:45:02.000Z",
      "edit_history_tweet_ids": [
        "2019950499521585288"
      ],
      "id": "2019950499521585288"
    },
    {
      "text": "ICE has no place in our schools. I joined Duluth Public Schools Superintendent John Magas, school board members, and staff today in Duluth. https://t.co/vr4oesf5Iq",
      "created_at": "2026-02-06T23:22:37.000Z",
      "edit_history_tweet_ids": [
        "2019914660297019773"
      ],
      "id": "2019914660297019773"
    },
    {
      "text": "The Winter Olympics are officially underway. I couldn’t be prouder of the 28 Minnesotans that will be competing, the second most of any state.\n\nLet’s bring home the gold!🏅🇺🇸 https://t.co/gOd66XYacW",
      "created_at": "2026-02-06T18:14:29.000Z",
      "edit_history_tweet_ids": [
        "2019837112510738442"
      ],
      "id": "2019837112510738442"
    },
    {
      "text": "ICE is wreaking havoc on Minnesota’s economy and costing our local businesses millions of dollars every week. This cannot go on. ICE needs to leave immediately. https://t.co/Peh2uZcoQA",
      "created_at": "2026-02-06T16:20:45.000Z",
      "edit_history_tweet_ids": [
        "2019808490823536830"
      ],
      "id": "2019808490823536830"
    },
    {
      "text": "Noem calls legal Haitians leeches. They win in court. \n\n“The Haitian plaintiffs include a neuroscientist researching Alzheimer’s, a bank’s software engineer, a lab assistant in toxicology, a college economics major and a nurse. No leeches joined the suit.” https://t.co/3K70tTjTik",
      "created_at": "2026-02-06T13:23:13.000Z",
      "edit_history_tweet_ids": [
        "2019763813680062582"
      ],
      "id": "2019763813680062582"
    },
    {
      "text": "I met with the Board of the Minnesota State Association of Narcotics Investigators to discuss how we can better protect Minnesotans. We must ensure law enforcement has the resources they need to take on the dangerous drugs like meth and fentanyl. https://t.co/CCS0er2wK8",
      "created_at": "2026-02-06T00:29:17.000Z",
      "edit_history_tweet_ids": [
        "2019569049144115291"
      ],
      "id": "2019569049144115291"
    },
    {
      "text": "Sheriffs and local law enforcement officers put their lives on the line every day to keep us safe.\n\nI’m honored to receive the Legislator of the Year award from the Major County Sheriffs of America and will keep working together to protect Minnesotans across our state. https://t.co/7ds7S4WO2Q",
      "created_at": "2026-02-05T22:39:12.000Z",
      "edit_history_tweet_ids": [
        "2019541346491449390"
      ],
      "id": "2019541346491449390"
    },
    {
      "text": "ICE is disrupting every aspect of life for so many Minnesotans and hurting our small businesses and local economies. Minnesota is coming together to shop local and support our small businesses, but what we really need is ICE out of our state.\n\nhttps://t.co/YobFkgyh63",
      "created_at": "2026-02-05T21:00:22.000Z",
      "edit_history_tweet_ids": [
        "2019516471333040565"
      ],
      "id": "2019516471333040565"
    },
    {
      "text": "Over 300 former prosecutors are urging DOJ to allow independent local &amp; state investigations into the killings of Renee Good and Alex Pretti.\n\nMN investigators worked with federal partners on the investigations into the Hortman and Annunciation Church shootings — they shouldn’t https://t.co/9TnGDCtxYe",
      "created_at": "2026-02-05T18:57:01.000Z",
      "edit_history_tweet_ids": [
        "2019485430367023109"
      ],
      "id": "2019485430367023109"
    },
    {
      "text": "ICE has no place in our schools and they need to get out of Minnesota. Our state’s educators are taking action to keep our students safe. https://t.co/p2E7Iy6tWA",
      "created_at": "2026-02-05T16:57:05.000Z",
      "edit_history_tweet_ids": [
        "2019455249996529786"
      ],
      "id": "2019455249996529786"
    }
  ]
}