{
  "data": [
    {
      "edit_history_tweet_ids": [
        "2019935277557641464"
      ],
      "created_at": "2026-02-07T00:44:33.000Z",
      "text": "Exciting that so many Michiganders are competing on the world stage this Winter Olympics! Cheering for them and the rest of Team USA. Best of luck!\nhttps://t.co/KqcMxwxchk",
      "id": "2019935277557641464"
    },
    {
      "edit_history_tweet_ids": [
        "2019892434214301994"
      ],
      "created_at": "2026-02-06T21:54:18.000Z",
      "text": "This is disgusting, indefensible, and blatantly racist. https://t.co/YsSKlLsrSF",
      "id": "2019892434214301994"
    },
    {
      "created_at": "2026-02-09T23:04:43.000Z",
      "text": "I’m pressing the Air Force to prioritize training our pilots at Selfridge Air National Guard Base for the new F-15EX fighters. We must ensure when those jets touch down in Macomb County, our crews are ready to fly on day one.\n\nA smooth transition is vital for our servicemembers",
      "edit_history_tweet_ids": [
        "2020997315863916595"
      ],
      "id": "2020997315863916595"
    },
    {
      "created_at": "2026-02-09T16:44:39.000Z",
      "text": "Happy Rosa Parks Day, Michigan! As we remember her courage and activism for civil rights across America, I’m also grateful for her service to the people of Detroit. We are proud to call her a Michigander. https://t.co/BjFnrLJ02I",
      "edit_history_tweet_ids": [
        "2020901668934541565"
      ],
      "id": "2020901668934541565"
    },
    {
      "id": "2019172820987572299",
      "text": "I’m calling on my colleagues to work with me on commonsense regulations for autonomous vehicles. The U.S. – not China – must lead the deployment of this technology and we must ensure these vehicles deliver on the promise of improving road safety and creating American jobs.",
      "edit_history_tweet_ids": [
        "2019172820987572299"
      ],
      "created_at": "2026-02-04T22:14:49.000Z"
    },
    {
      "edit_history_tweet_ids": [
        "2021022702249681210"
      ],
      "text": "This statement from the President is completely backwards. Michigan’s economy is highly integrated with Canada and the Detroit-Windsor corridor is one of the busiest border crossings for trade in our entire country. We’ve wanted this bridge for years because it will be a boon for https://t.co/8WADQFO9eX",
      "created_at": "2026-02-10T00:45:35.000Z",
      "id": "2021022702249681210"
    },
    {
      "edit_history_tweet_ids": [
        "2021254801598669248"
      ],
      "created_at": "2026-02-10T16:07:52.000Z",
      "text": "As a former officer in the Navy Reserve, I had the honor to serve alongside some of the most dedicated men and women I’ve ever met. It was great to meet some of those currently serving aboard the USS Michigan, one of the many vessels critical to our national security. https://t.co/GXC8Kq9kZs",
      "id": "2021254801598669248"
    }
  ]
}