{
  "data": [
    {
      "text": "Communities across America are anxious about the skyrocketing premiums they have seen since the expiration of the ACA’s enhanced premium tax credits.\n\nI will continue fighting to expand health care access and lower costs.\nhttps://t.co/ajJmpvXJkR",
      "edit_history_tweet_ids": [
        "2020940886943920452"
      ],
      "id": "2020940886943920452",
      "created_at": "2026-02-09T19:20:29.000Z"
    },
    {
      "text": "While we've made great strides towards ending the substance use epidemic, too many veterans are still losing their lives due to overdoses. \n\nI’m proud to introduce a new, bipartisan bill to help veterans and their caregivers more easily access overdose reversal agents at no cost. https://t.co/do4hwwRXlj",
      "edit_history_tweet_ids": [
        "2020885802629112006"
      ],
      "id": "2020885802629112006",
      "created_at": "2026-02-09T15:41:36.000Z"
    },
    {
      "id": "2020999750406021466",
      "edit_history_tweet_ids": [
        "2020999750406021466"
      ],
      "created_at": "2026-02-09T23:14:23.000Z",
      "text": "On Friday, I visited @PhoenixTailings' rare earth metallization facility in Exeter, NH.\n\nIt was great to see first-hand the impact of critical minerals to the Granite State economy, and discuss how my SECURE Minerals Act would expand production and processing in the U.S. https://t.co/ZGONiKa6mI"
    },
    {
      "id": "2020979611933475323",
      "edit_history_tweet_ids": [
        "2020979611933475323"
      ],
      "created_at": "2026-02-09T21:54:22.000Z",
      "text": "Continued investigation and treatment for victims of anomalous health incidents is critical to the health of our national security personnel.\n\n@DeptofWar must do right by these victims.\n\nhttps://t.co/M3ZLCbT5AV"
    },
    {
      "id": "2019812875213369750",
      "text": "In just the past week, President Trump has threatened our allies, from Canada to South Korea, with reckless tariffs.\n\nThe President’s on-a-whim strategy isn’t just hurting our allies; it’s directly impacting Granite Staters, who are struggling to afford everyday essentials.",
      "created_at": "2026-02-06T16:38:10.000Z",
      "edit_history_tweet_ids": [
        "2019812875213369750"
      ]
    },
    {
      "created_at": "2026-02-05T17:00:52.000Z",
      "text": "When family emergencies strike, workers need flexibility to respond. 32 years ago, the Family and Medical Leave Act was signed into law to do just that.\n\nOur work isn’t over. I’ll keep fighting so workers don’t have to compromise a paycheck to take care of unexpected emergencies.",
      "edit_history_tweet_ids": [
        "2019456198634828226"
      ],
      "id": "2019456198634828226"
    },
    {
      "text": "Securing reliable, domestic supplies of critical minerals will create jobs and strengthen our economic and national security. I'm leading the bipartisan SECURE Minerals Act to help power the industries of the future. \n\nLearn more below⬇️ https://t.co/taaYopasF3",
      "id": "2019175189355876832",
      "edit_history_tweet_ids": [
        "2019175189355876832"
      ],
      "created_at": "2026-02-04T22:24:14.000Z"
    },
    {
      "text": "https://t.co/c2CpUEqm7y",
      "id": "2019129730835128775",
      "edit_history_tweet_ids": [
        "2019129730835128775"
      ],
      "created_at": "2026-02-04T19:23:36.000Z"
    },
    {
      "text": "ICYMI: With pregnant women and new moms across the country facing an escalating and deeply worrying mental health crisis, @SenatorBaldwin and I introduced a bill to increase access to mental health and substance use disorder services so that women—and their families—can thrive.",
      "id": "2019129728951808056",
      "edit_history_tweet_ids": [
        "2019129728951808056"
      ],
      "created_at": "2026-02-04T19:23:35.000Z"
    },
    {
      "created_at": "2026-02-10T21:18:19.000Z",
      "id": "2021332929037861349",
      "text": "It was a pleasure to join my friend, former Ambassador Swett, to express support for our Danish allies and discuss the future of NATO—which remains critical to our national security.\n\nThank you to @WorldAffairsNH for hosting such an important conversation.\nhttps://t.co/UTjURaD0Sw",
      "edit_history_tweet_ids": [
        "2021332929037861349"
      ]
    }
  ]
}