{
  "data": [
    {
      "text": "Pass the SAVE America Act. https://t.co/FsvGzLvgAf",
      "id": "2020898507683455089",
      "edit_history_tweet_ids": [
        "2020898507683455089"
      ],
      "created_at": "2026-02-09T16:32:05.000Z"
    },
    {
      "text": "This is heartbreaking. My prayers are with the victims. But I’m also angry — because this tragedy was preventable.\n\nMy Safer Truckers Act with @RepGregSteube, which would strengthen requirements to ensure only those who are supposed to be in this country are behind the wheel of https://t.co/zjC36Eg5za",
      "id": "2019584166472323314",
      "edit_history_tweet_ids": [
        "2019584166472323314"
      ],
      "created_at": "2026-02-06T01:29:22.000Z"
    },
    {
      "text": "This is a no brainer and not controversial. Americans support identification to vote because only Americans should be able to choose their representatives to make laws on their behalf.\nLet’s Pass the Save America Act! https://t.co/lVvYfOhDar",
      "id": "2019523104876450122",
      "edit_history_tweet_ids": [
        "2019523104876450122"
      ],
      "created_at": "2026-02-05T21:26:43.000Z"
    },
    {
      "text": "We just announced Florida is receiving nearly half a billion dollars in recovery assistance from FEMA!\n \nAfter a disaster, it is essential that we get aid to the affected communities as soon as possible. I’m fighting to make this process more transparent with my TRACK Act, and I https://t.co/Bx2hll9mHo",
      "id": "2019502181150322886",
      "edit_history_tweet_ids": [
        "2019502181150322886"
      ],
      "created_at": "2026-02-05T20:03:35.000Z"
    },
    {
      "text": "Amazing to attend the National Prayer Breakfast and hear from @POTUS with my good friends @RepAaronBean and @RepCarlos. United in faith, we pray for wisdom and courage to serve our fellow Americans and this great nation. https://t.co/pGCZcMcQpA",
      "id": "2019486209479704910",
      "edit_history_tweet_ids": [
        "2019486209479704910"
      ],
      "created_at": "2026-02-05T19:00:07.000Z"
    },
    {
      "text": "As a mother of a child still in school, I hear from families how critical the need for combatting sextortion has become. \n\nScammers use these tactics to lure, manipulate, torment and extort children for money and images. These monsters must be brought to justice. That’s why https://t.co/L4XEKifG14",
      "id": "2019192271565123647",
      "edit_history_tweet_ids": [
        "2019192271565123647"
      ],
      "created_at": "2026-02-04T23:32:06.000Z"
    },
    {
      "text": "Return to tradition. Force debate on the most pressing issue facing this country. Pass the SAVE America Act. \nI’M ALL IN 🖐🏻🇺🇸",
      "id": "2019065216684654722",
      "edit_history_tweet_ids": [
        "2019065216684654722"
      ],
      "created_at": "2026-02-04T15:07:14.000Z"
    },
    {
      "text": "Ensuring licensed commercial semitruck drivers can read road signs in English just makes sense to ensure safe roadways for Floridians. We must pass my Safer Truckers Act ASAP!\n\nhttps://t.co/96QIPr0qu6",
      "id": "2019964091188802030",
      "edit_history_tweet_ids": [
        "2019964091188802030"
      ],
      "created_at": "2026-02-07T02:39:03.000Z"
    },
    {
      "text": "We must continue to combat antisemitism against Jewish students as threats on college campuses around the country have skyrocketed. I met with the @UF Student Government to discuss their efforts back home. https://t.co/jQrQdnQfq6",
      "id": "2019924166158479545",
      "edit_history_tweet_ids": [
        "2019924166158479545"
      ],
      "created_at": "2026-02-07T00:00:24.000Z"
    },
    {
      "text": "I am excited to see the U.S. Olympic &amp; Paralympic Committee announce several Floridians are headed to Milano Cortina 2026! Congratulations to our Florida athletes on this achievement. Look forward to you representing our great country and the Sunshine State on the world stage!",
      "id": "2019882099109761395",
      "edit_history_tweet_ids": [
        "2019882099109761395"
      ],
      "created_at": "2026-02-06T21:13:14.000Z"
    }
  ]
}