{
  "data": [
    {
      "text": "Today we celebrate President Ronald Reagan’s birthday – a leader whose vision for freedom and opportunity inspired communities across America, including hardworking Iowans. 🇺🇸",
      "edit_history_tweet_ids": [
        "2019870888758505930"
      ],
      "id": "2019870888758505930",
      "created_at": "2026-02-06T20:28:41.000Z"
    },
    {
      "text": "I’ve long fought to promote renewable fuels that power rural communities, strengthen American agriculture, and help lower prices for consumers – both at the pump and the grocery store.\nhttps://t.co/ZUu3UHTdq1",
      "edit_history_tweet_ids": [
        "2019855974891417855"
      ],
      "id": "2019855974891417855",
      "created_at": "2026-02-06T19:29:26.000Z"
    },
    {
      "text": "The Winter Olympics start today, and Iowa has their very own on the world stage! ❄️\n\nCheering on Iowan Zach Stoppelmoor as he competes for Team USA. 🇺🇸\nhttps://t.co/J2e2fSzM68",
      "edit_history_tweet_ids": [
        "2019840629363331196"
      ],
      "id": "2019840629363331196",
      "created_at": "2026-02-06T18:28:27.000Z"
    },
    {
      "text": "While Washington prints money, @PalmerLuckey is spot-on!\n\nThis is exactly why the Pentagon needs to pass a clean audit – to ensure taxpayer dollars are being used efficiently and effectively to advance our national security.\n\nhttps://t.co/3FCQ2RQfQ8",
      "edit_history_tweet_ids": [
        "2019823901237473516"
      ],
      "id": "2019823901237473516",
      "created_at": "2026-02-06T17:21:59.000Z"
    },
    {
      "text": "These remarkable young women are showing what dedication looks like on the mat! 💪\n\nI’m proud to celebrate women’s sports that inspire the next generation of young girls.\nhttps://t.co/EWGeM2m3om",
      "edit_history_tweet_ids": [
        "2019784141068267598"
      ],
      "id": "2019784141068267598",
      "created_at": "2026-02-06T14:43:59.000Z"
    },
    {
      "text": "Access to safe and effective crop protection tools are critical to Iowans’ work to feed the world!\n \nI will continue fighting to make sure our farmers have access to scientifically-supported pesticides, like Dicamba, to grow our food supply safely.",
      "edit_history_tweet_ids": [
        "2019547647598793057"
      ],
      "id": "2019547647598793057",
      "created_at": "2026-02-05T23:04:15.000Z"
    },
    {
      "edit_history_tweet_ids": [
        "2019505117859627107"
      ],
      "created_at": "2026-02-05T20:15:15.000Z",
      "id": "2019505117859627107",
      "text": "🚨 A shocking $182 million taxpayer dollars was wasted by bureaucrats negotiating cushy perks FOR THEMSELVES rather than serving the American people just last year.\n\nCongress needs to pass my Protecting Taxpayers’ Wallets Act to crackdown on taxpayer-funded union time and get https://t.co/OrtSCg2WGm"
    },
    {
      "edit_history_tweet_ids": [
        "2019455487347945847"
      ],
      "created_at": "2026-02-05T16:58:02.000Z",
      "id": "2019455487347945847",
      "text": "Now that we know the Minnesota fraud could total $9 billion, I’m working to claw back the money and stop the fraud in the first place.\n\nAmericans’ hard-earned tax dollars shouldn’t be wasted on these schemes! https://t.co/orhAQUIeDz"
    },
    {
      "edit_history_tweet_ids": [
        "2019189540012134763"
      ],
      "created_at": "2026-02-04T23:21:15.000Z",
      "id": "2019189540012134763",
      "text": "The murderous Iranian regime sows chaos, oppresses its own people, and chants death to America.\n\nPresident Trump is standing strong with the people of Iran and against Iran-backed terror."
    },
    {
      "edit_history_tweet_ids": [
        "2019183335612785027"
      ],
      "created_at": "2026-02-04T22:56:36.000Z",
      "id": "2019183335612785027",
      "text": "It was an honor to receive the Taxpayer Defender of the Month award from @NTU.\n\nI promised to make Washington squeal, and I’ve been hard at work exposing waste, fraud, and abuse.\n\nI look forward to delivering a new legislative package soon that will stop fraud BEFORE it happens! https://t.co/mUuey8r5SK"
    }
  ]
}