{
  "data": [
    {
      "edit_history_tweet_ids": [
        "2020151084241564067"
      ],
      "created_at": "2026-02-07T15:02:05.000Z",
      "text": "Energy security is national security.\n\nLast week, my Taiwan Energy Security and Anti-Embargo Act passed out of committee to help our Taiwanese partners resist Communist China’s coercion.\n\nBy unleashing American energy, we strengthen our allies and protect our interests abroad.",
      "id": "2020151084241564067"
    },
    {
      "edit_history_tweet_ids": [
        "2019898004635840729"
      ],
      "created_at": "2026-02-06T22:16:26.000Z",
      "text": "Nebraska farmers fuel our country and feed the world! \n \nI’m grateful for the @EPA's recent steps to maintain access to safe, critical crop protection tools. This provides the certainty our producers need for vital planting decisions as the 2026 season nears. https://t.co/S5PGsoPTRF",
      "id": "2019898004635840729"
    },
    {
      "edit_history_tweet_ids": [
        "2019814293366272277"
      ],
      "created_at": "2026-02-06T16:43:48.000Z",
      "text": "Even if this was a Lion King meme, a reasonable person sees the racist context to this. The White House should do what anyone does when they make a mistake: remove this and apologize. https://t.co/53Pv7xXCef",
      "id": "2019814293366272277"
    },
    {
      "edit_history_tweet_ids": [
        "2019783504096121144"
      ],
      "created_at": "2026-02-06T14:41:27.000Z",
      "text": "Red tape creates additional costs and deters much-needed investments in rural affordable housing.\n\nThat’s why I’m fighting to pass the Streamlining Rural Housing Act. The bill eliminates duplicative regulations that delay approvals so that we can build more housing in rural NE.",
      "id": "2019783504096121144"
    },
    {
      "text": "GDP is up 4.4% and inflation is down from Biden-era highs. Average American families will get $1,000 more back in taxes thanks to Working Families Tax Cuts.\n\nUnder President Trump’s leadership, the U.S. economy is entering 2026 from a position of strength.",
      "created_at": "2026-02-05T19:12:56.000Z",
      "id": "2019489437667737936",
      "edit_history_tweet_ids": [
        "2019489437667737936"
      ]
    },
    {
      "text": "Great to have @SecScottBessent before the @BankingGOP today. I commended him for the updated 45Z guidance.\n\nBy ensuring only American-grown feedstocks qualify for the Clean Fuel Production Credit, we’re keeping taxpayer dollars at home and supporting Nebraska farmers.",
      "created_at": "2026-02-05T16:32:41.000Z",
      "id": "2019449107425730991",
      "edit_history_tweet_ids": [
        "2019449107425730991"
      ]
    },
    {
      "text": "My prayers are with Joan Meyer’s family in the wake of this tragedy.\n\nhttps://t.co/ci7mDUr6g2",
      "created_at": "2026-02-04T22:06:17.000Z",
      "id": "2019170673382273069",
      "edit_history_tweet_ids": [
        "2019170673382273069"
      ]
    },
    {
      "text": "Happy National Girls and Women in Sports Day! Today we celebrate the strength, talent, and determination of girls and women in sports.\n\nI’ll always fight to protect women’s and girls’ athletics for future generations! https://t.co/cYLphNtNtN",
      "id": "2019049731809247682",
      "edit_history_tweet_ids": [
        "2019049731809247682"
      ],
      "created_at": "2026-02-04T14:05:42.000Z"
    }
  ]
}