{
  "data": [
    {
      "id": "2021275852768460985",
      "created_at": "2026-02-10T17:31:31.000Z",
      "edit_history_tweet_ids": [
        "2021275852768460985"
      ],
      "text": "@SenLummis So you never cared about the Epstein files until you saw it was 9 year olds??? But you were cool with the 14 year olds?? Oh… you aren’t running again. Makes sense"
    },
    {
      "id": "2021261905239622139",
      "created_at": "2026-02-10T16:36:06.000Z",
      "edit_history_tweet_ids": [
        "2021261905239622139"
      ],
      "text": "@SenLummis I wish women had been in charge of this investigation all along. THe Epstein files underscores the how badly our @FBI and other investigative agency treat women and survivors of SA. \nWhy did it take you so long to understand this??\nhttps://t.co/CbnPFakigD"
    },
    {
      "id": "2021261210604167450",
      "created_at": "2026-02-10T16:33:20.000Z",
      "edit_history_tweet_ids": [
        "2021261210604167450"
      ],
      "text": "@TBizzleAMP @devkotonono @SenLummis Account based in Hong Kong so basically a state sponsored troublemaker."
    },
    {
      "id": "2021260977753252229",
      "created_at": "2026-02-10T16:32:24.000Z",
      "edit_history_tweet_ids": [
        "2021260977753252229"
      ],
      "text": "@devkotonono @SenLummis No, that’s your crowd. Not ours. Very happy for her. Had no idea about her orientation until I saw your post. So that begs the question, why is the @GOP obsessed with orientation and genitals? I know I could care less."
    },
    {
      "id": "2021255371285758122",
      "created_at": "2026-02-10T16:10:08.000Z",
      "edit_history_tweet_ids": [
        "2021255371285758122"
      ],
      "text": "@SenLummis Did you really admit that you \"didn't care\" about the Epstein files because you thought all of the victims were teenagers? That is a wild take from the pro-life party. To only start carrying when you find out 9 year olds were also involved is deeply concerning."
    },
    {
      "id": "2021241869330526244",
      "created_at": "2026-02-10T15:16:29.000Z",
      "edit_history_tweet_ids": [
        "2021241869330526244"
      ],
      "text": "@SenLummis Re. Epstein files and rich pedophiles:  “I sort of intentionally deferred to others … “ - Sen Lummis\n\nIOW … 🙈 🙉 🙊"
    },
    {
      "id": "2021218825539145805",
      "created_at": "2026-02-10T13:44:55.000Z",
      "edit_history_tweet_ids": [
        "2021218825539145805"
      ],
      "text": "@SenLummis https://t.co/llCZpW03Kg\n\n“I don’t care. I don’t know what the big deal is.’ But now I see what the big deal is, and it was worth investigating.”\nSo are you gonna stop protecting Pedos in our gov’t now???"
    },
    {
      "id": "2021218369240797535",
      "created_at": "2026-02-10T13:43:06.000Z",
      "edit_history_tweet_ids": [
        "2021218369240797535"
      ],
      "text": "@SenLummis What do you mean you didn’t see the big deal in investigating Epstein till the 9 yr old victim was revealed? Are you OK? 14 year olds cannot consent."
    },
    {
      "id": "2021215935965634646",
      "created_at": "2026-02-10T13:33:26.000Z",
      "edit_history_tweet_ids": [
        "2021215935965634646"
      ],
      "text": "@SenLummis Where's the justice for Epstein's victims? You soulless ghoul. You call yourselves the party of \"Christian family values\" and parade around that you need to \"protect the children,\" while you literally said, \"I don’t care. I don’t see what the big deal is.\" https://t.co/bLSt5PyXUU"
    },
    {
      "id": "2021212232550391956",
      "created_at": "2026-02-10T13:18:43.000Z",
      "edit_history_tweet_ids": [
        "2021212232550391956"
      ],
      "text": "@SenLummis What a piece of shit you are @SenLummis . You didn’t “care” about the abused girls in the Epstein files, and you only paid attention to the pedophile protectors around you for information? Shameful. I hope you don’t have kids."
    }
  ]
}