{
  "data": [
    {
      "id": "2020285191508705710",
      "text": "@SenRonJohnson @POTUS You notice trump only complains about the election he lost. Do you notice that Ron? What does that tell you?",
      "created_at": "2026-02-07T23:54:59.000Z",
      "edit_history_tweet_ids": [
        "2020285191508705710"
      ]
    },
    {
      "id": "2020280356185035178",
      "text": "@SenRonJohnson @POTUS We’ll have a country.  You just won’t have a job.",
      "created_at": "2026-02-07T23:35:46.000Z",
      "edit_history_tweet_ids": [
        "2020280356185035178"
      ]
    },
    {
      "id": "2020260876662829538",
      "text": "@TheLastSon38 More excuses. It’s amazing any of us older folks, who weren’t lazy, looking for a handout, worked, ever got to vote. We had to have an ID. If you aren’t intelligent enough to get an ID, you don’t deserve to vote. I bet if someone gifted them money, they’d find one to claim it?",
      "created_at": "2026-02-07T22:18:22.000Z",
      "edit_history_tweet_ids": [
        "2020260876662829538"
      ]
    },
    {
      "id": "2020253757368627662",
      "text": "@SenRonJohnson @POTUS Reasonable enough. Leftys say he's trying to steal the elections w this somehow have lost their minds &amp; grasping onto every possible issue to avoid it as it's the only way they'd ever win is if DEMS CAN CHEAT YET AGAIN &amp; They're gonna pull out all the stops this time!",
      "created_at": "2026-02-07T21:50:04.000Z",
      "edit_history_tweet_ids": [
        "2020253757368627662"
      ]
    },
    {
      "id": "2020246270976446648",
      "text": "@NorthAnonamous @SenRonJohnson @POTUS PS. I have over 35 yrs of computer networking experience for fortune 50 companies. I have practical experience with what solid state chips are capable of without the user knowing. nk.",
      "created_at": "2026-02-07T21:20:20.000Z",
      "edit_history_tweet_ids": [
        "2020246270976446648"
      ]
    },
    {
      "id": "2020245328780489185",
      "text": "@NorthAnonamous @SenRonJohnson @POTUS Most US states use the latest computerized Voting machines from numerous mfg's.\nWe also lead the way in AI.\nCharged particle weapons, and neat stuff like that.\nAnd aurguably, Fusion power...\nCanada? eh? stick to cartoons.",
      "created_at": "2026-02-07T21:16:35.000Z",
      "edit_history_tweet_ids": [
        "2020245328780489185"
      ]
    },
    {
      "id": "2020235582434341045",
      "text": "@SenRonJohnson @4ac05a74fdcf47c @POTUS Sir our elections are a joke, If we do not lock our election process down we will lose our country for infamy @realDonaldTrump Please do whatever is humanly possible to secure our elections for this is not even the tip of the iceberg. The left is cheating at an alarming rate 🗳️ https://t.co/D2qbl8yIJo",
      "created_at": "2026-02-07T20:37:51.000Z",
      "edit_history_tweet_ids": [
        "2020235582434341045"
      ]
    },
    {
      "id": "2020233834835382720",
      "text": "@SenRonJohnson @POTUS we all know you're trying to steal the election again. Only the dumbest people possible would fall for this.",
      "created_at": "2026-02-07T20:30:55.000Z",
      "edit_history_tweet_ids": [
        "2020233834835382720"
      ]
    },
    {
      "id": "2020232791594791249",
      "text": "@Micheal58598542 @SenRonJohnson @POTUS Yeah that's why they are in control of the government right? https://t.co/zDlsrZAivb",
      "created_at": "2026-02-07T20:26:46.000Z",
      "edit_history_tweet_ids": [
        "2020232791594791249"
      ]
    },
    {
      "id": "2020232492079542381",
      "text": "@SenRonJohnson @POTUS Well why didn't they rig this election? Why have they allowed Republicans to basically dominate politics for years now? You have the Presidency, House, Senate and SCOTUS, but tell me again how elections are rigged. If anything maybe its the other way around.",
      "created_at": "2026-02-07T20:25:34.000Z",
      "edit_history_tweet_ids": [
        "2020232492079542381"
      ]
    }
  ]
}