{
  "data": [
    {
      "edit_history_tweet_ids": [
        "2020544399709774105"
      ],
      "created_at": "2026-02-08T17:04:59.000Z",
      "id": "2020544399709774105",
      "text": "“But let him ask in faith, nothing wavering. For he that wavereth is like a wave of the sea driven with the wind and tossed.” — James 1:6"
    },
    {
      "edit_history_tweet_ids": [
        "2019915825986302027"
      ],
      "created_at": "2026-02-06T23:27:15.000Z",
      "id": "2019915825986302027",
      "text": "Thank you, @POTUS, for approving the major disaster declaration request for Tennessee counties in need following Winter Storm Fern. \n\nThe Volunteer State is grateful for this swift action to help individuals, families, and businesses recover from this disaster. https://t.co/0NbP0vDjYy"
    },
    {
      "id": "2019884882508632258",
      "text": "Great work by the Trump administration yet again on the arrest of the Benghazi terror suspect. No attack on American lives should go unpunished. This administration has worked day and night to ensure enemies of the United States face American justice on American soil.",
      "edit_history_tweet_ids": [
        "2019884882508632258"
      ],
      "created_at": "2026-02-06T21:24:18.000Z"
    },
    {
      "id": "2019799790562021674",
      "text": "Great column by @KimStrassel. Russ Vought has helped put our nation back on a fiscally responsible path after four years of crushing Bidenflation.\nhttps://t.co/rB533UtfkY",
      "edit_history_tweet_ids": [
        "2019799790562021674"
      ],
      "created_at": "2026-02-06T15:46:10.000Z"
    },
    {
      "id": "2020936262513983958",
      "created_at": "2026-02-09T19:02:06.000Z",
      "edit_history_tweet_ids": [
        "2020936262513983958"
      ],
      "text": "No, it is not enough. She should resign. https://t.co/oY47Q9oNlv"
    },
    {
      "id": "2020914777196003418",
      "created_at": "2026-02-09T17:36:44.000Z",
      "edit_history_tweet_ids": [
        "2020914777196003418"
      ],
      "text": "You can’t make this up. Requiring ID to get into a campaign event but not to vote in an election is asinine. \n\nEvery Democrat should join Republicans in supporting the SAVE America Act because it is common sense.\nhttps://t.co/VH9f3vwxN5"
    },
    {
      "text": "Thanks to @realDonaldTrump, Americans are about to pay less for prescription drugs. \n\nTrumpRx is a direct-to-consumer platform that will offer lower costs and better options for consumers. This administration is making history by making health care affordable again.",
      "edit_history_tweet_ids": [
        "2019582267622846765"
      ],
      "id": "2019582267622846765",
      "created_at": "2026-02-06T01:21:49.000Z"
    },
    {
      "text": "Americans deserve a Supreme Court that is impartial and above political influence. When a Justice participates in such a highly politicized event, it raises ethical questions. We need an investigation into Justice Jackson’s ability to remain impartial.\nhttps://t.co/nzid4Fnl35",
      "edit_history_tweet_ids": [
        "2019575687640912332"
      ],
      "id": "2019575687640912332",
      "created_at": "2026-02-06T00:55:40.000Z"
    },
    {
      "text": "Grateful that the Vice President will be leading the administration’s efforts to tackle fraud.\n\nALL fraud should be a deportable offense, and I introduced the Fraud Accountability Act to ensure people who come to America to steal from our citizens are held accountable. https://t.co/Lc2aN01mTS",
      "edit_history_tweet_ids": [
        "2019563143358489005"
      ],
      "id": "2019563143358489005",
      "created_at": "2026-02-06T00:05:49.000Z"
    },
    {
      "text": "It was great meeting with Korea Zinc to discuss their nearly $7 billion investment in our state. This project supports high-paying jobs in Tennessee and helps make certain we are not depending on China for critical minerals. https://t.co/HSzycexwcn",
      "edit_history_tweet_ids": [
        "2019555187422376203"
      ],
      "id": "2019555187422376203",
      "created_at": "2026-02-05T23:34:12.000Z"
    }
  ]
}