{
  "data": [
    {
      "edit_history_tweet_ids": [
        "2018124809524453800"
      ],
      "created_at": "2026-02-02T00:50:24.000Z",
      "text": "President Trump has been clear: Iran’s terrorist regime can never have a nuclear weapon. \n\nThe Ayatollahs are well-aware of our military’s capabilities and would be wise to take President Trump’s words seriously.",
      "id": "2018124809524453800"
    },
    {
      "edit_history_tweet_ids": [
        "2017719795806798185"
      ],
      "created_at": "2026-01-31T22:01:01.000Z",
      "text": "It was great to welcome @FBIDirectorKash to Little Rock today. We spoke with local utilities and law enforcement about the work being done by the men and women of the FBI to keep Arkansans safe from drug cartels and Communist China. https://t.co/FkiJz9u1HC",
      "id": "2017719795806798185"
    },
    {
      "edit_history_tweet_ids": [
        "2017668826628808993"
      ],
      "created_at": "2026-01-31T18:38:29.000Z",
      "text": "Lithium is too important to rely on Communist China for. Fortunately, South Arkansas is home to the world’s highest-grade lithium.\n\nEl Dorado’s Standard Lithium is poised to lead the way in domestic lithium production. https://t.co/ljSRGKs9Fl",
      "id": "2017668826628808993"
    },
    {
      "created_at": "2026-01-30T17:11:12.000Z",
      "text": "This new partnership between @USArmy and Hanwha Defense USA in Pine Bluff will bring more jobs and economic opportunity to central Arkansas.  https://t.co/K2fGhWkIsC",
      "edit_history_tweet_ids": [
        "2017284474552176829"
      ],
      "id": "2017284474552176829"
    },
    {
      "created_at": "2026-01-30T16:10:50.000Z",
      "text": "South Arkansas is home to high-grade lithium that is vital to our national security.\n\nThe technology at El Dorado’s Standard Lithium is crucial to increasing our domestic lithium supply and decreasing our reliance on Communist China. https://t.co/e383IE61bC",
      "edit_history_tweet_ids": [
        "2017269282954989836"
      ],
      "id": "2017269282954989836"
    },
    {
      "created_at": "2026-01-30T15:28:29.000Z",
      "text": "American AI dominance shouldn’t mean higher energy prices for Arkansans. My DATA Act will modernize power regulations to keep energy prices down. https://t.co/JHFk2KPV55",
      "edit_history_tweet_ids": [
        "2017258622686757299"
      ],
      "id": "2017258622686757299"
    },
    {
      "text": "American innovations in biotech are too important ‍to fall into the hands of bad actors or be hamstrung by outdated federal policies.\n\nOur bill is an important first step towards a comprehensive framework for biosecurity and biosafety. https://t.co/xI122n2doB",
      "edit_history_tweet_ids": [
        "2019102413458927869"
      ],
      "created_at": "2026-02-04T17:35:03.000Z",
      "id": "2019102413458927869"
    },
    {
      "text": "Judge Shepherd has dedicated his career to upholding the rule of law in Arkansas. As an accomplished prosecutor and judge, he has done a tremendous job keeping our communities safe from violent criminals and drugs. I’m honored to support his nomination. https://t.co/XEEo0CtAPy",
      "edit_history_tweet_ids": [
        "2019096404287762784"
      ],
      "created_at": "2026-02-04T17:11:10.000Z",
      "id": "2019096404287762784"
    },
    {
      "text": "I’m glad I was able to meet with Arkansans who are in D.C. for the National Prayer Breakfast. I pray God continues to bless you, Arkansas, and this great Nation. https://t.co/PjCzZYtkAA",
      "edit_history_tweet_ids": [
        "2019091487263256800"
      ],
      "created_at": "2026-02-04T16:51:38.000Z",
      "id": "2019091487263256800"
    },
    {
      "text": "I’m glad I was able to meet with John Brown University and Hendrix College to discuss higher education in Arkansas. https://t.co/gVqINutspB",
      "edit_history_tweet_ids": [
        "2019055912992788524"
      ],
      "created_at": "2026-02-04T14:30:16.000Z",
      "id": "2019055912992788524"
    }
  ]
}