{
  "data": [
    {
      "id": "2019805624608141760",
      "text": "Nebraska’s tribal colleges are crucial resources for our tribal members. I met with one of their students, LeAnn Walker, who shared how her college experience positively shaped her life and gave her the opportunity for a fresh start. https://t.co/s0hQabS8Po",
      "created_at": "2026-02-06T16:09:21.000Z",
      "edit_history_tweet_ids": [
        "2019805624608141760"
      ]
    },
    {
      "id": "2019786629087457737",
      "text": "Passing funding bills is an opportunity to bring back Nebraska tax dollars we send to Washington every year. \n\nMy team works closely with localities back home to ensure we get their input on how their federal tax money is spent.\n\nRead more about the community projects I secured https://t.co/2BFh3CBv4l",
      "created_at": "2026-02-06T14:53:52.000Z",
      "edit_history_tweet_ids": [
        "2019786629087457737"
      ]
    },
    {
      "id": "2019518416059789347",
      "text": "President Trump is right to not extend the New START Treaty—which Russia has outright ignored for years.\n\nMoving forward, we cannot forget China's breathtaking buildup of its nuclear arsenal. This must also be considered in any arms control strategy. https://t.co/BJtJdyfGA6",
      "created_at": "2026-02-05T21:08:05.000Z",
      "edit_history_tweet_ids": [
        "2019518416059789347"
      ]
    },
    {
      "id": "2019494944235221264",
      "text": "Nebraskans deserve peace of mind when they fly, which is why I secured federal funding to complete the parallel taxiway and improve lighting at the Nebraska City Airport.\n\nhttps://t.co/h4SxxrsQjj",
      "created_at": "2026-02-05T19:34:49.000Z",
      "edit_history_tweet_ids": [
        "2019494944235221264"
      ]
    },
    {
      "text": "I’m proud to have secured this funding – as a member of @AppropsGOP – for Nebraska communities that will strengthen emergency services, enhance our airports, and improve infrastructure. https://t.co/4SvjjnH0BQ",
      "edit_history_tweet_ids": [
        "2019148050778718345"
      ],
      "id": "2019148050778718345",
      "created_at": "2026-02-04T20:36:23.000Z"
    },
    {
      "text": "The verdict is clear: EV tax credits are inefficient, inequitable, and irresponsible.\n\nThat’s why Republicans eliminated them in the Working Families Tax Cuts. \n\nRead my full @FoxNews op-ed: https://t.co/f5NqiT5JIF",
      "edit_history_tweet_ids": [
        "2019100398179750361"
      ],
      "id": "2019100398179750361",
      "created_at": "2026-02-04T17:27:02.000Z"
    }
  ]
}