{
  "data": [
    {
      "id": "2019873414362853490",
      "created_at": "2026-02-06T20:38:44.000Z",
      "text": "I visited Bridgeport Rescue Mission today to learn about their amazing faith-based programming for thousands of people in need in the city. https://t.co/RM3cbGmFhv",
      "edit_history_tweet_ids": [
        "2019873414362853490"
      ]
    },
    {
      "id": "2019872541159092575",
      "created_at": "2026-02-06T20:35:15.000Z",
      "text": "I was in Hartford today with nursing home workers to tell the story of how the industry gave $5 million to Trump to get him to reverse a rule requiring minimum staffing in nursing homes. A gift to Trump’s millionaire nursing home backers. https://t.co/wJggYr1T3e",
      "edit_history_tweet_ids": [
        "2019872541159092575"
      ]
    },
    {
      "id": "2019853469390368845",
      "created_at": "2026-02-06T19:19:28.000Z",
      "text": "This the correct response to your preferred candidate posting an image of Black people as monkeys. https://t.co/5YmZ6Y9CcT",
      "edit_history_tweet_ids": [
        "2019853469390368845"
      ]
    },
    {
      "id": "2019841118851191211",
      "created_at": "2026-02-06T18:30:24.000Z",
      "text": "a. There is something deeply rotten about our politics that Republicans are so tribal that they excuse overt, heinous racism from their leader. \n\nb. There is no “staffer” freelance posting from the President’s account at midnight. https://t.co/Qq9mHEmhZX",
      "edit_history_tweet_ids": [
        "2019841118851191211"
      ]
    },
    {
      "id": "2019774400686383549",
      "created_at": "2026-02-06T14:05:17.000Z",
      "text": "The AI industry is driving up our electricity prices and ruining our landscapes with these huge data centers not to cure cancer but to do this. https://t.co/i7CGEbS5MY",
      "edit_history_tweet_ids": [
        "2019774400686383549"
      ]
    },
    {
      "created_at": "2026-02-05T18:50:14.000Z",
      "id": "2019483725117939942",
      "text": "Grateful to hear no one was hurt and that Connecticut's emergency management and environmental teams are working fast to keep us informed after this morning's train derailment. My office is staying in contact with the experts on the ground as the situation develops.",
      "edit_history_tweet_ids": [
        "2019483725117939942"
      ]
    },
    {
      "created_at": "2026-02-05T15:55:03.000Z",
      "id": "2019439638088159514",
      "text": "Here's what the big tech companies have already committed to spend this fall to purge from Congress those who want to restrain them.\n\nCrypto - $190M\nAI - $100M\nMeta - $70M\n\nHuge numbers. Fundamentally corrupt. We shouldn't accept this. https://t.co/QNIBja4sv4",
      "edit_history_tweet_ids": [
        "2019439638088159514"
      ]
    },
    {
      "created_at": "2026-02-05T15:51:15.000Z",
      "id": "2019438681761677570",
      "text": "We don't really need to connect the dots because Trump is doing it for us. He wants to take control of federal elections so he can rig them in his favor. He knows he can't win a fair election. https://t.co/JpYmsrcUTg",
      "edit_history_tweet_ids": [
        "2019438681761677570"
      ]
    },
    {
      "text": "Twitter's AI bot is trained with many disturbing instructions like: “You’re always a little horny and aren’t afraid to go full Literotica.”\n\nThis is what the AI industry is building. It turns out they aren't curing cancer or solving our energy crisis.\nhttps://t.co/DCOUK25bL0",
      "created_at": "2026-02-04T15:32:27.000Z",
      "edit_history_tweet_ids": [
        "2019071563115417927"
      ],
      "id": "2019071563115417927"
    },
    {
      "created_at": "2026-02-09T17:49:06.000Z",
      "id": "2020917891864969431",
      "text": "We need to ask ourselves an important question about our AI future. \n\nWhat happens to the human soul if we outsource basic functions - like friendship, creativity and problem solving - to machines? The answer shouldn't just be left to industry. It needs to involve all of us. https://t.co/3ObFDcfnzc",
      "edit_history_tweet_ids": [
        "2020917891864969431"
      ]
    }
  ]
}