{
  "data": [
    {
      "created_at": "2026-02-09T22:28:51.000Z",
      "id": "2020988292884287929",
      "text": "@SenatorBaldwin you are seriously missing something here.  department of education has closed on the federal level and money will no longer be spent on salaries but now distributed to the states to spend on children,  with the department closed thats more money for schools",
      "edit_history_tweet_ids": [
        "2020988292884287929"
      ]
    },
    {
      "created_at": "2026-02-09T20:54:14.000Z",
      "id": "2020964480944099729",
      "text": "@SenatorBaldwin You are such a liar! Everyone knows that the education is going to the states to control instead of being federally controlled by our government which it shouldn't be in the first place. Stop gaslighting people!",
      "edit_history_tweet_ids": [
        "2020964480944099729"
      ]
    },
    {
      "created_at": "2026-02-09T19:46:35.000Z",
      "id": "2020947454741578140",
      "text": "@SenatorBaldwin You should be forced out of office. Everyone knows public schools suck because their mission has changed from educating to indoctrinating. We know your real problem is that it's a financial loss to demoncrats. 3 more years to go! Enjoy the revolution, scumbag!",
      "edit_history_tweet_ids": [
        "2020947454741578140"
      ]
    },
    {
      "created_at": "2026-02-09T18:18:02.000Z",
      "id": "2020925172866519542",
      "text": "@SenatorBaldwin What specifically did Trump do that made it harder for this high school to teach?",
      "edit_history_tweet_ids": [
        "2020925172866519542"
      ]
    },
    {
      "created_at": "2026-02-09T14:42:55.000Z",
      "id": "2020871035512381718",
      "text": "@SenatorBaldwin https://t.co/ek5jNx3qqc",
      "edit_history_tweet_ids": [
        "2020871035512381718"
      ]
    },
    {
      "created_at": "2026-02-09T14:21:31.000Z",
      "id": "2020865649686302762",
      "text": "@SenatorBaldwin The schools are letting students walkout to protest. Students were provoking fights, if they get seriously injured who is accountable.",
      "edit_history_tweet_ids": [
        "2020865649686302762"
      ]
    },
    {
      "created_at": "2026-02-09T12:34:27.000Z",
      "id": "2020838707067260967",
      "text": "@SenatorBaldwin Milwaukee is the worst of the worst. Largest budget in the state with the lowest test scores. It's not about fixing the schools it's about fixing the culture.",
      "edit_history_tweet_ids": [
        "2020838707067260967"
      ]
    },
    {
      "created_at": "2026-02-09T10:35:40.000Z",
      "id": "2020808811921957030",
      "text": "@MrFrundl3s @SenatorBaldwin The Bible warns against dishonest leaders, including reverends, stating that they will face consequences for misleading their followers. Verses like Jeremiah 23:1-2 declare woe to shepherds who scatter and destroy the flock, emphasizing the importance of integrity in leadership",
      "edit_history_tweet_ids": [
        "2020808811921957030"
      ]
    },
    {
      "created_at": "2026-02-09T10:33:39.000Z",
      "id": "2020808303660470354",
      "text": "@SenatorBaldwin It's  the federal government that screwed our education up. 38th in the world for science.  Give it back to the statrs,we had great students the .",
      "edit_history_tweet_ids": [
        "2020808303660470354"
      ]
    },
    {
      "created_at": "2026-02-09T05:24:03.000Z",
      "id": "2020730393524392271",
      "text": "@SenatorBaldwin #impeachtrumpnow",
      "edit_history_tweet_ids": [
        "2020730393524392271"
      ]
    }
  ]
}