{
  "data": [
    {
      "created_at": "2026-02-04T14:55:24.000Z",
      "edit_history_tweet_ids": [
        "2019062238674296925"
      ],
      "text": "Passage of this package shows that we as a Congress can come together in a bipartisan way to deliver real results for the people we are honored to represent.",
      "id": "2019062238674296925"
    },
    {
      "created_at": "2026-02-04T14:55:23.000Z",
      "edit_history_tweet_ids": [
        "2019062234073141625"
      ],
      "text": "I appreciate the members of the House and Senate Appropriations Committees for working with me to pass these bills. This would not have been possible without the leadership and partnership of Chair @TomColeOK04, Vice Chair @PattyMurray, and Ranking Member @rosadelauro. https://t.co/de45Qh6OZf",
      "id": "2019062234073141625"
    },
    {
      "created_at": "2026-02-04T14:55:21.000Z",
      "edit_history_tweet_ids": [
        "2019062226372403329"
      ],
      "text": "The legislation will invest in lifesaving biomedical research that can lead to health advances for prevention, treatment, and cures; support our national security and our military men and women, including by funding the 3.8 percent pay raise for service members; modernize our",
      "id": "2019062226372403329"
    },
    {
      "created_at": "2026-02-04T14:55:21.000Z",
      "edit_history_tweet_ids": [
        "2019062224317218990"
      ],
      "text": "With the signing of this five-bill package, 96% of government has been funded through negotiations that have brought both sides of the aisle and both sides of Congress to the table. It has not been easy, but it has been worth it.",
      "id": "2019062224317218990"
    },
    {
      "created_at": "2026-02-06T20:44:53.000Z",
      "edit_history_tweet_ids": [
        "2019874962228535787"
      ],
      "text": "A beautiful and heartbreaking article. Freeman Short was one of seven people who lost their lives when the fishing vessel Lily Jean sank last week. He was a bright light, he was a soldier and student. He loved his family, friends, the great Maine outdoors, and his country.\n\nThis",
      "id": "2019874962228535787"
    },
    {
      "created_at": "2026-02-06T17:32:11.000Z",
      "edit_history_tweet_ids": [
        "2019826469493719184"
      ],
      "text": "Tim is right. This was appalling. https://t.co/9LbpP9JxbN",
      "id": "2019826469493719184"
    },
    {
      "id": "2020639634116768154",
      "text": "Go Pats! https://t.co/Xs8mgPEYNx",
      "edit_history_tweet_ids": [
        "2020639634116768154"
      ],
      "created_at": "2026-02-08T23:23:25.000Z"
    },
    {
      "text": "It was great to see Frank Del Duca of Bethel lead Team USA as a flag bearer during this year's opening ceremony. Also enjoyable was NBC’s cutaway showing Frank’s friends and family celebrating in Newry at Frank's Bar &amp; Grille. Wishing Frank, all the athletes from Maine, and Team https://t.co/k5Xea95UOZ",
      "created_at": "2026-02-07T15:14:52.000Z",
      "edit_history_tweet_ids": [
        "2020154302291910671"
      ],
      "id": "2020154302291910671"
    }
  ]
}