{
  "data": [
    {
      "id": "2021611219551953260",
      "text": "@SenMikeLee More pointless, expensive assholery\n\nThe US Election has .0001% fraud usually #MAGA VOTING TWICE OR FOR DEAD RELATIVES\n\nSometimes corrupt @GOP campaigns harvesting and changing ballots like in North Carolina https://t.co/0ecq9rb4U5",
      "edit_history_tweet_ids": [
        "2021611219551953260"
      ],
      "created_at": "2026-02-11T15:44:09.000Z"
    },
    {
      "id": "2021608825946579223",
      "text": "@SenMikeLee The GOP’s goal is low voter turnout. It took over a decade to implement Real ID. Now you want to do it again in 9 mos? Who pays for states to reregister every citizen? \nNot everyone is given a certified bc at birth. Some states only issue in person. Pass legislation fixing that.",
      "edit_history_tweet_ids": [
        "2021608825946579223"
      ],
      "created_at": "2026-02-11T15:34:38.000Z"
    },
    {
      "id": "2021588766834438404",
      "text": "@SenMikeLee Pass the SAVE Act now! NO EXCUSES! https://t.co/kVJA4Skgbj",
      "edit_history_tweet_ids": [
        "2021588766834438404"
      ],
      "created_at": "2026-02-11T14:14:55.000Z"
    },
    {
      "id": "2021586446038052886",
      "text": "@SenMikeLee Senator you should put a bill before all of these morons that says we no longer need identification to buy a gun. We don’t need a background check and we don’t need a 10 day waiting. Period. If we don’t have to show ID to vote then why do we have to show ID to buy a gun?",
      "edit_history_tweet_ids": [
        "2021586446038052886"
      ],
      "created_at": "2026-02-11T14:05:42.000Z"
    },
    {
      "id": "2021575333040783457",
      "text": "@SenMikeLee You are all lying about it. We see you. Why aren’t you demanding @LeaderJohnThune \nResign. If you truly wanted to pass this, that’s what you would be doing. Not making social media posts.",
      "edit_history_tweet_ids": [
        "2021575333040783457"
      ],
      "created_at": "2026-02-11T13:21:33.000Z"
    },
    {
      "id": "2021573751020634507",
      "text": "@SenMikeLee https://t.co/qr2lVQfQBk",
      "edit_history_tweet_ids": [
        "2021573751020634507"
      ],
      "created_at": "2026-02-11T13:15:15.000Z"
    },
    {
      "id": "2021561872789749797",
      "text": "@SenMikeLee The Constitution says states run their elections, not the Feds. They can implement ID, as some already have.\nI've had to prove myself twice in my lifetime to register.\n\nWhy do you believe the @GOP shouldn't follow the oath they took to that document over the Sore Loser in Chief?",
      "edit_history_tweet_ids": [
        "2021561872789749797"
      ],
      "created_at": "2026-02-11T12:28:03.000Z"
    },
    {
      "id": "2021534691581726935",
      "text": "@SenMikeLee Treasonous Chuck Shumer is full of shit. Where is he getting this 21 million number from? Where is this group of people he mysteriously quotes? All the Demtards to is lie. Have you seen even one of these people he is talking about being interviewed anywhere? \n\n Stop playing his",
      "edit_history_tweet_ids": [
        "2021534691581726935"
      ],
      "created_at": "2026-02-11T10:40:03.000Z"
    },
    {
      "id": "2021497242994237510",
      "text": "@SenMikeLee I want you to tell people that people without voter ID are choosing your top cop, the attorney general! It's the reason politicians can rob you blind right in front of your face and laugh! They rob you from top to bottom as the states raise your taxes to pay for the crimes your",
      "edit_history_tweet_ids": [
        "2021497242994237510"
      ],
      "created_at": "2026-02-11T08:11:14.000Z"
    },
    {
      "id": "2021473191437500537",
      "text": "@SenMikeLee About as many Americans as there are registered voters (173M) have obtained a Real ID (which requires a birth certificate &amp; in person interview). Could states cross reference Real ID holders with voter rolls? Why not make Real ID the Voter ID of choice since it fits the criteria? https://t.co/xcilWWmzDl",
      "edit_history_tweet_ids": [
        "2021473191437500537"
      ],
      "created_at": "2026-02-11T06:35:40.000Z"
    }
  ]
}