{
  "data": [
    {
      "id": "2019854380460044682",
      "edit_history_tweet_ids": [
        "2019854281277354078",
        "2019854380460044682"
      ],
      "created_at": "2026-02-06T19:23:06.000Z",
      "text": "Today is #WearRedDay, and February is American Heart Month. Each year, more than 350,000 cardiac arrests in the U.S. occur outside of hospitals, with most happening at home. This month, I encourage you to learn hands-only CPR and support @American_Heart's Nation of Lifesavers https://t.co/QiROWBZoGg"
    },
    {
      "id": "2019854281277354078",
      "edit_history_tweet_ids": [
        "2019854281277354078",
        "2019854380460044682"
      ],
      "created_at": "2026-02-06T19:22:42.000Z",
      "text": "Today is #WearRedDay, and February is American Heart Month. Each year, more than 350,000 cardiac arrests in the U.S. occur outside of hospitals, with most happening at home. This month, I encourage you to learn hands-only CPR and support the @American_Heart's Nation of Lifesavers https://t.co/U5qiuRql4Z"
    },
    {
      "id": "2019807500585804059",
      "edit_history_tweet_ids": [
        "2019807500585804059"
      ],
      "created_at": "2026-02-06T16:16:49.000Z",
      "text": "Risk Rating 2.0 is driving flood insurance costs so high that families and small businesses are being priced out of coverage altogether, leading to the growing loss of participation in the NFIP. @SenatorWicker and I joined our colleagues in urging FEMA to halt further https://t.co/as0jbBuKy9"
    },
    {
      "id": "2020493064691966052",
      "text": "“And we know that in all things God works for the good of those who love him, who have been called according to his purpose.” – Romans 8:28",
      "edit_history_tweet_ids": [
        "2020493064691966052"
      ],
      "created_at": "2026-02-08T13:41:00.000Z"
    },
    {
      "edit_history_tweet_ids": [
        "2019516012106826002"
      ],
      "created_at": "2026-02-05T20:58:32.000Z",
      "text": "Many producers in Mississippi are burdened with clearing damage from Winter Storm Ferm while continuing to face critical planting decisions for the next growing season, including what crop protection tools will be available. I hope @EPA acts soon to provide clarity on the",
      "id": "2019516012106826002"
    },
    {
      "edit_history_tweet_ids": [
        "2020964362727432274"
      ],
      "created_at": "2026-02-09T20:53:46.000Z",
      "text": "I thank @POTUS for approving Mississippi’s request over the weekend for a major disaster declaration following Winter Storm Fern. This unlocks federal resources to help our communities in 38 counties recover and rebuild after this devastating storm.\n\nMore details here: https://t.co/Dq8PEUZjz5",
      "id": "2020964362727432274"
    },
    {
      "edit_history_tweet_ids": [
        "2020927410003222758"
      ],
      "created_at": "2026-02-09T18:26:56.000Z",
      "text": "Mississippi wrapped up a subpar duck season, and years of neglected maintenance at the Mathews Brake and Yazoo National Wildlife Refuges are part of the problem. I included a directive in a FY26 appropriations bill to fix these issues. I am urging FWS Director Brian Nesvik to https://t.co/JmjPVnPeRe",
      "id": "2020927410003222758"
    },
    {
      "id": "2019180628042826229",
      "text": "I joined the Mississippi congressional delegation today in asking President Trump to approve Governor Reeves’s request for an expedited major disaster declaration in response to Winter Storm Fern. This approval would unlock critical federal resources to strengthen and accelerate https://t.co/nrzZHzV0au",
      "edit_history_tweet_ids": [
        "2019180628042826229"
      ],
      "created_at": "2026-02-04T22:45:50.000Z"
    },
    {
      "edit_history_tweet_ids": [
        "2019166232344203293"
      ],
      "id": "2019166232344203293",
      "text": "I’ve gotten a lot of questions about why I didn’t vote for an amendment last week that would have cut funding for the HHS Office of Refugee Resettlement. \n\nHere’s the clear answer: https://t.co/9qhLBna7Ix",
      "created_at": "2026-02-04T21:48:38.000Z"
    },
    {
      "edit_history_tweet_ids": [
        "2019119003046932595"
      ],
      "id": "2019119003046932595",
      "text": "Today we recognize National Girls and Women in Sports Day and applaud the dedication, talent, and grit shown by female athletes at every level. Fair competition depends on acknowledging biological reality, and women and girls deserve equal chances to compete and succeed in spaces https://t.co/ZmMzP3oZTw",
      "created_at": "2026-02-04T18:40:58.000Z"
    }
  ]
}