{
  "data": [
    {
      "created_at": "2026-02-06T00:25:06.000Z",
      "edit_history_tweet_ids": [
        "2019567994549203053"
      ],
      "text": "Tina and I were honored to attend the 74th National Prayer Breakfast and join in prayer for our nation.\n\nGod bless America. https://t.co/1VcahTxCcS",
      "id": "2019567994549203053"
    },
    {
      "created_at": "2026-02-05T21:33:36.000Z",
      "edit_history_tweet_ids": [
        "2019524837744734242"
      ],
      "text": "Wishing the best of luck to Ohio athletes as they compete in the 2026 Winter Olympics.\n \nYou make our state and our country proud! \n\nhttps://t.co/Xqg49WZQi5",
      "id": "2019524837744734242"
    },
    {
      "created_at": "2026-02-05T19:44:08.000Z",
      "edit_history_tweet_ids": [
        "2019497286921798000"
      ],
      "text": "Jobs are returning to Ohio.\n \nFrom investments to factory construction, our state is ready to ensure that Made-in-America means Made-in-Ohio. https://t.co/u8ENlTjT9T",
      "id": "2019497286921798000"
    },
    {
      "created_at": "2026-02-05T16:13:24.000Z",
      "edit_history_tweet_ids": [
        "2019444254473425379"
      ],
      "text": "Ohioans want jobs, affordability, and good quality of life—and the Working Families Tax Cuts Act delivers.\n \nFrom no tax on tips, no tax on overtime, and a $2,200 child tax credit, life will become more affordable for working families. https://t.co/Ae686C6d9P",
      "id": "2019444254473425379"
    },
    {
      "created_at": "2026-02-04T22:29:15.000Z",
      "edit_history_tweet_ids": [
        "2019176452118442358"
      ],
      "text": "Let’s make it easy to vote and hard to cheat.\n \nWith the SAVE Act, we can do both. https://t.co/77W5ReKPvW",
      "id": "2019176452118442358"
    },
    {
      "created_at": "2026-02-04T21:37:34.000Z",
      "edit_history_tweet_ids": [
        "2019163446999413129"
      ],
      "text": "As a father to two female athletes and the husband of another, I know how critical it is that we protect women’s and girls’ opportunities in sports.\n \nOn National Girls and Women in Sports Day, we celebrate their accomplishments across the globe, and renew our pledge to preserve https://t.co/lZo71k62NN",
      "id": "2019163446999413129"
    },
    {
      "text": "No matter who’s playing in the Super Bowl, Ohio is still on the field.\n\nFrom the Pro Football Hall of Fame in Canton to the Wilson manufacturing plant in Ada, football runs through Ohio.\n\nHave a fun and safe Super Bowl weekend! https://t.co/Igu3LHCHq7",
      "edit_history_tweet_ids": [
        "2020161212579709368"
      ],
      "id": "2020161212579709368",
      "created_at": "2026-02-07T15:42:20.000Z"
    },
    {
      "text": "The tax benefits in the Working Families Tax Cuts Act allow Ohioans to keep more of what they earn! https://t.co/btUCUduK60",
      "created_at": "2026-02-08T21:31:21.000Z",
      "edit_history_tweet_ids": [
        "2020611434984730863"
      ],
      "id": "2020611434984730863"
    },
    {
      "edit_history_tweet_ids": [
        "2020976094606946596"
      ],
      "id": "2020976094606946596",
      "created_at": "2026-02-09T21:40:23.000Z",
      "text": "Ohio has more than 5,000 miles of rail. As we’re reminded of the tragedy in East Palestine, ensuring our rail freight operates safely is more important than ever.\n\nI had a great meeting with Teamsters Rail Conference President Mark Wallace to talk about how we can do just that. https://t.co/80B7ZFpXle"
    },
    {
      "edit_history_tweet_ids": [
        "2020953896487624830"
      ],
      "id": "2020953896487624830",
      "created_at": "2026-02-09T20:12:11.000Z",
      "text": "Millions of Americans face a benefits cliff: A dramatic decrease in federal assistance for receiving a small raise in income.\n \nMy Upward Mobility Act would solve this problem by allowing states to group federal benefits to cater to individual Americans’ needs, instead of a https://t.co/MWmIkTTGaC"
    }
  ]
}