{
  "data": [
    {
      "created_at": "2026-02-05T14:06:40.000Z",
      "edit_history_tweet_ids": [
        "2019412362436977143"
      ],
      "text": "@SenAngusKing So our contractor who had all local guys working for him should hire visa workers over Maine citizens? We had a young woman who picked berries to supplement her income when we lived in IL she wasn't a visa worker, I washed dishes in a restaurant as a young man. What job exactly",
      "id": "2019412362436977143"
    },
    {
      "created_at": "2026-02-05T03:56:15.000Z",
      "edit_history_tweet_ids": [
        "2019258743289192741"
      ],
      "text": "@SenAngusKing Negotiation with Iran is not an option. Not now. Not ever. Not under any circumstances. #R2PforIran #IranMassacre #IranRevolution2026  #NoDealWithMullahs  #NoDealWithIRGC",
      "id": "2019258743289192741"
    },
    {
      "created_at": "2026-02-04T22:10:30.000Z",
      "edit_history_tweet_ids": [
        "2019171733350052217"
      ],
      "text": "@SenAngusKing Senator King, sir,\n\nSupporting the Iranian people's revolution to overthrow the mullahs means you'll be free from these endless, dangerous nuclear negotiations forever. No more appeasement—recognize @PahlaviReza as transition leader and stand with freedom!\n\n#RezaPahlaviForIran",
      "id": "2019171733350052217"
    },
    {
      "created_at": "2026-02-04T19:45:06.000Z",
      "edit_history_tweet_ids": [
        "2019135141248135313"
      ],
      "text": "@SenAngusKing Invite them in and they don't leave.  Try to get them to leave and you're called a fascist.  These rich people in Congress care very little about everyday Americans. They take their insider trading and make millions by securing cheap labor for companies.",
      "id": "2019135141248135313"
    },
    {
      "created_at": "2026-02-04T19:31:21.000Z",
      "edit_history_tweet_ids": [
        "2019131683430396148"
      ],
      "text": "@SenAngusKing Most people have zero issue with Visas. The issue comes when they overstay, don't behave, or commit a crime.",
      "id": "2019131683430396148"
    },
    {
      "created_at": "2026-02-04T19:03:05.000Z",
      "edit_history_tweet_ids": [
        "2019124571371438542"
      ],
      "text": "@SenAngusKing Hey dumb ass, time to reward work and not the fat lazy, welfare leaches.",
      "id": "2019124571371438542"
    },
    {
      "created_at": "2026-02-04T18:42:38.000Z",
      "edit_history_tweet_ids": [
        "2019119422410051728"
      ],
      "text": "@SenAngusKing What the hell are you talking about?  You defend foreigners over Mainers?  Go the hell away Anus. You are just as bad as @GovJanetMills",
      "id": "2019119422410051728"
    }
  ]
}