{
  "data": [
    {
      "id": "2018701002292023794",
      "created_at": "2026-02-03T14:59:59.000Z",
      "edit_history_tweet_ids": [
        "2018701002292023794"
      ],
      "text": "It was great to start the day with rural water advocates from Arkansas and across the country who are working to deliver safe, affordable and reliable drinking water. We’re proud to partner with Chris Harris and his team at the Arkansas Rural Water Association to secure funding https://t.co/8pZJgrQAGX"
    },
    {
      "id": "2018684330302722514",
      "created_at": "2026-02-03T13:53:44.000Z",
      "edit_history_tweet_ids": [
        "2018684330302722514"
      ],
      "text": "Camden and the state of Arkansas proudly help anchor the American Arsenal of Freedom. Congratulations to Lockheed on this next important chapter. https://t.co/IC1paQDB6I"
    },
    {
      "id": "2018445022379851990",
      "created_at": "2026-02-02T22:02:48.000Z",
      "edit_history_tweet_ids": [
        "2018445022379851990"
      ],
      "text": "🚨 Big wins for AR communities in the additional Senate-passed FY26 funding bills.\n\nI was proud to secure investments to strengthen maternal health, workforce training, transportation infrastructure &amp; national security missions across The Natural State ⤵️\nhttps://t.co/XiH02aTLPU"
    },
    {
      "id": "2018349083560218665",
      "created_at": "2026-02-02T15:41:35.000Z",
      "edit_history_tweet_ids": [
        "2018349083560218665"
      ],
      "text": "Arkansas farmers are resilient, but they’re still confronting very difficult conditions to plant and harvest the next crop. As Chairman of the @SenateAgGOP I’m continuing to push for more assistance to support our ag economy and rural communities.\nhttps://t.co/EbscC0bQZT"
    },
    {
      "id": "2018328894915457167",
      "created_at": "2026-02-02T14:21:21.000Z",
      "edit_history_tweet_ids": [
        "2018328894915457167"
      ],
      "text": "Strong partnerships are driving growth and opportunity statewide. READ my latest weekly column on recent visits to Northwest Arkansas and the River Valley supporting veterans, small businesses and infrastructure projects shaping Arkansas’s future.\nhttps://t.co/lbpPVM7ckZ"
    },
    {
      "id": "2018122491688858026",
      "created_at": "2026-02-02T00:41:11.000Z",
      "edit_history_tweet_ids": [
        "2018122491688858026"
      ],
      "text": "Strong cooperation to protect critical infrastructure and combat violent crime and illegal drugs benefits Arkansans and all Americans. I valued hearing firsthand from those on the front lines with Sen. Cotton, FBI Director Kash Patel, AG Tim Griffin and Adam Telle. https://t.co/NcAtEW2yNo"
    },
    {
      "created_at": "2026-01-31T23:24:26.000Z",
      "edit_history_tweet_ids": [
        "2017740788013105607"
      ],
      "id": "2017740788013105607",
      "text": "Let’s Go Hogs! #WPS\n\nhttps://t.co/YsYBjbVyOQ"
    },
    {
      "created_at": "2026-01-31T21:52:45.000Z",
      "edit_history_tweet_ids": [
        "2017717714912219646"
      ],
      "id": "2017717714912219646",
      "text": "Tune in for another quick recap of some of last week’s events, including meeting with Arkansans, committee hearings and more. #ARinDC https://t.co/P5uRLCSEK9"
    },
    {
      "edit_history_tweet_ids": [
        "2018749849781338573"
      ],
      "created_at": "2026-02-03T18:14:05.000Z",
      "text": "Congratulations to Harrison native Clay Fowlkes on his confirmation to serve as a judge on the U.S District Court for the Western District of Arkansas. His dedication and extensive experience in pursuing justice will serve him well.\nhttps://t.co/q9fYEvleGm",
      "id": "2018749849781338573"
    },
    {
      "id": "2018820179296387241",
      "created_at": "2026-02-03T22:53:33.000Z",
      "edit_history_tweet_ids": [
        "2018820179296387241"
      ],
      "text": "Learn more ⬇️ https://t.co/NeqKL4Nj33"
    }
  ]
}