{
  "data": [
    {
      "created_at": "2026-02-08T19:15:43.000Z",
      "text": "@SenJoniErnst FUND ICE NO RESTRICTIONS-if u Concede to the dems demands regarding ICE, Dont bother to pass SAVE,It Wont Be Enforced If ICE not at polls&amp;dont bother Funding ICE because Repubs just Abolished ICE,stopped all arrests &amp; deportations FOR Dems-please dont betray Citizens Again",
      "edit_history_tweet_ids": [
        "2020577299343753651"
      ],
      "id": "2020577299343753651"
    },
    {
      "created_at": "2026-02-07T18:32:03.000Z",
      "text": "@SenJoniErnst Iowan here, Virginia dems are jerrymandering the GOP out of existence with a 10 - 1 redistricting. Not really representative of a state that just had a GOP governor or fair. Let’s at least have only citizens voting once? I’m concerned with fair elections! Pass SAVE America act!",
      "edit_history_tweet_ids": [
        "2020203922867253326"
      ],
      "id": "2020203922867253326"
    },
    {
      "created_at": "2026-02-07T15:32:42.000Z",
      "text": "@SenJoniErnst Vote FOR the SAVE Act unless y'all want to be investigated for voting AGAINST it.  Look at the freaking numbers.  Are y'all that dirty???? https://t.co/02RJuuQusZ",
      "edit_history_tweet_ids": [
        "2020158787324203359"
      ],
      "id": "2020158787324203359"
    },
    {
      "created_at": "2026-02-07T14:20:50.000Z",
      "text": "@SenJoniErnst Pass the SAVE ACT!!",
      "edit_history_tweet_ids": [
        "2020140704069001523"
      ],
      "id": "2020140704069001523"
    },
    {
      "created_at": "2026-02-07T12:42:56.000Z",
      "text": "@SenJoniErnst your casual acceptance of men and women enabling and participating is disgusting. https://t.co/04ChAuCIs6",
      "edit_history_tweet_ids": [
        "2020116066060423177"
      ],
      "id": "2020116066060423177"
    },
    {
      "created_at": "2026-02-07T01:51:34.000Z",
      "text": "@SenJoniErnst Y’all remember how Joni never agreed with anything the Republicans did and now she’s falling all over Trump like she’s giving them bjs all the time she knows she’s coming up in November. Don’t vote for her place.",
      "edit_history_tweet_ids": [
        "2019952143378313602"
      ],
      "id": "2019952143378313602"
    },
    {
      "created_at": "2026-02-07T01:17:36.000Z",
      "text": "@SenJoniErnst Y’all need to read the Epstein files. Shows Trump, Bannon, Epstein committed treason against the USA. Also, child rape and trafficking. Punishment for treason? Death, imprisonment, disqualification from holding office. The PEOPLE demand justice for Americans and for victims.",
      "edit_history_tweet_ids": [
        "2019943593536876900"
      ],
      "id": "2019943593536876900"
    },
    {
      "created_at": "2026-02-06T23:14:02.000Z",
      "text": "@SenJoniErnst Grow food. Drill oil. Keep it simple.",
      "edit_history_tweet_ids": [
        "2019912498053300514"
      ],
      "id": "2019912498053300514"
    },
    {
      "created_at": "2026-02-06T22:03:21.000Z",
      "text": "@SenJoniErnst It’s poisoning the atmosphere you’re not helping anyone you’re creating a false economy that is going to collapse but then you’ll be gone so you don’t care cause you got our pension we paid for 10% ethanol is one thing but 15% is killer for the atmosphere and you know it",
      "edit_history_tweet_ids": [
        "2019894710651797943"
      ],
      "id": "2019894710651797943"
    },
    {
      "created_at": "2026-02-06T21:50:59.000Z",
      "text": "@SenJoniErnst Is that how it worked out with corn?",
      "edit_history_tweet_ids": [
        "2019891599950434363"
      ],
      "id": "2019891599950434363"
    }
  ]
}