{
  "data": [
    {
      "created_at": "2026-02-02T18:00:34.000Z",
      "text": "If a president can threaten one journalist for doing their job, they can threaten every journalist. Where do these violations of the First Amendment stop? We have to stand up, speak out, and keep calling out every attack on Americans’ rights. https://t.co/twBxgVAgQp",
      "edit_history_tweet_ids": [
        "2018384059890602197"
      ],
      "id": "2018384059890602197"
    },
    {
      "created_at": "2026-02-01T17:31:17.000Z",
      "text": "As we begin Black History Month, it’s worth remembering that Black history is American history. Every February is both a celebration and a call to action, honoring the contributions by Black Americans that built our country and recommitting to the work that remains to achieve",
      "edit_history_tweet_ids": [
        "2018014302989345240"
      ],
      "id": "2018014302989345240"
    },
    {
      "text": "Tom Homan and this Administration are treating U.S. cities like war zones. This mentality is dangerous, and it’s gotten people hurt and killed. https://t.co/hkYuBPcjMQ",
      "id": "2019186959810433143",
      "created_at": "2026-02-04T23:11:00.000Z",
      "edit_history_tweet_ids": [
        "2019186959810433143"
      ]
    },
    {
      "text": "Great to see Marisol Garcia, President of @ArizonaEA, while she was in town to share her expertise. Listening to Arizona educators and families is how we build schools that work for kids and give them the best chance to succeed. https://t.co/YYBU67hPjC",
      "id": "2019174525653430579",
      "created_at": "2026-02-04T22:21:36.000Z",
      "edit_history_tweet_ids": [
        "2019174525653430579"
      ]
    },
    {
      "text": "Kristi Noem is in Arizona today, but don’t get that confused with her doing her job. Under her leadership, ICE is creating chaos and making people less safe — including in Phoenix. She should be fired so the agency can be overhauled to enforce our laws without getting Americans https://t.co/2dYBe9GtG6",
      "id": "2019135374640001467",
      "created_at": "2026-02-04T19:46:01.000Z",
      "edit_history_tweet_ids": [
        "2019135374640001467"
      ]
    },
    {
      "text": "Rosa Parks was born February 4, 1913, in Tuskegee, Alabama. She showed the world that courage doesn’t have to be loud to be powerful and that no matter where you were born, each of us has the power to change history and make the world a better place. https://t.co/yAaLoG8lDm",
      "id": "2019121781886579112",
      "created_at": "2026-02-04T18:52:00.000Z",
      "edit_history_tweet_ids": [
        "2019121781886579112"
      ]
    },
    {
      "text": "We had a hearing on what happens when the last major nuclear treaty between the U.S. and Russia expires this week. It's nothing good. Unfortunately, reducing nuclear risk doesn't seem to be a priority for this Administration. https://t.co/zFl7AdVeE3",
      "id": "2019091415616344168",
      "created_at": "2026-02-04T16:51:21.000Z",
      "edit_history_tweet_ids": [
        "2019091415616344168"
      ]
    },
    {
      "text": "I just left the court.\n\nToday’s hearing was not just for my Constitutional rights, but for millions of retired veterans and all Americans. There is nothing more fundamental to our Democracy than the freedom to speak out about our government – that’s what I’m fighting for.",
      "id": "2018830412265713765",
      "created_at": "2026-02-03T23:34:12.000Z",
      "edit_history_tweet_ids": [
        "2018830412265713765"
      ]
    },
    {
      "text": "Every astronaut who’s walked on the Moon has trained in Flagstaff, and Arizona is proud of that legacy. I’m excited that now one of our own has a chance to be among the first people to step foot on the Moon in decades as a candidate for Artemis III. https://t.co/FAyntV1zwc",
      "id": "2018788515585393003",
      "created_at": "2026-02-03T20:47:44.000Z",
      "edit_history_tweet_ids": [
        "2018788515585393003"
      ]
    },
    {
      "text": "This Administration is going after peaceful protesters, journalists, veterans—me included. That’s unconstitutional. The First Amendment protects peaceful assembly, a free press, and every American’s right to speak up about their government. https://t.co/NqZsPqcxGF",
      "id": "2018763827454546368",
      "created_at": "2026-02-03T19:09:37.000Z",
      "edit_history_tweet_ids": [
        "2018763827454546368"
      ]
    }
  ]
}