{
  "data": [
    {
      "id": "2020575441505948042",
      "text": "During the Super Bowl, we will experience a uniquely American phenomenon: drug ads.\n\nThese commercials risk deceiving patients about the cost, safety, &amp; effectiveness of meds.\n\nI’m working w/ @ChuckGrassley, @RogerMarshallMD, &amp; @DrMakaryFDA on bills to crack down on misleading",
      "created_at": "2026-02-08T19:08:20.000Z",
      "edit_history_tweet_ids": [
        "2020575441505948042"
      ]
    },
    {
      "created_at": "2026-02-06T20:20:30.000Z",
      "id": "2019868825572057561",
      "text": "DHS must provide answers about what is happening to children at this facility.\n\nNo child should be detained in these conditions. https://t.co/1U2zxJNJRJ",
      "edit_history_tweet_ids": [
        "2019868825572057561"
      ]
    },
    {
      "created_at": "2026-02-06T20:20:24.000Z",
      "id": "2019868801890922881",
      "text": "@JudiciaryDems DHS must provide answers about what is happening to children at this facility.\n\nNo child should be detained in these conditions.",
      "edit_history_tweet_ids": [
        "2019868801890922881"
      ]
    },
    {
      "created_at": "2026-02-06T15:57:08.000Z",
      "id": "2019802549356835195",
      "text": "President Trump is pressuring state election officials to do his bidding—again.\n\nIt didn’t work last time, and it can’t work this time.\n\nState election officials must hold the line and protect our right to vote.",
      "edit_history_tweet_ids": [
        "2019802549356835195"
      ]
    },
    {
      "created_at": "2026-02-06T15:48:14.000Z",
      "id": "2019800307731976457",
      "text": "Donald Trump posted a racist video of our former President and First Lady Barack and Michelle Obama.\n\nIt is sadly par for the course for a President who revels in his cruelty and racism. When will Republicans draw the line and call out this vile conduct?",
      "edit_history_tweet_ids": [
        "2019800307731976457"
      ]
    },
    {
      "created_at": "2026-02-06T14:58:41.000Z",
      "id": "2019787840792433034",
      "text": "Wishing the nine Illinoisans representing the United States in the 2026 Olympic Winter Games the best of luck! I’ll be cheering you on to bring home the gold for Team USA!",
      "edit_history_tweet_ids": [
        "2019787840792433034"
      ]
    },
    {
      "created_at": "2026-02-05T22:04:39.000Z",
      "id": "2019532650328076716",
      "text": "As he desperately tries to distract from his failing agenda, Donald Trump launches a sales scheme that is a giveaway to Big Pharma &amp; will not meaningfully reduce drug prices for American families. https://t.co/smqFOMr4gS",
      "edit_history_tweet_ids": [
        "2019532650328076716"
      ]
    },
    {
      "created_at": "2026-02-05T21:30:18.000Z",
      "id": "2019524003824619964",
      "text": "I joined my colleagues to meet with Ruslan Stefanchuk, Speaker of the Ukrainian Parliament, and Ukrainian Ambassador Olha Stefanishyna, who told us about the Ukrainians suffering amid Russia’s attacks on the power grid. Now more than ever, we must work in Congress to support our",
      "edit_history_tweet_ids": [
        "2019524003824619964"
      ]
    },
    {
      "created_at": "2026-02-05T20:30:16.000Z",
      "id": "2019508895593689507",
      "text": "When Americans buy a supplement, they trust it’s safe. But some unscrupulous companies break that trust by marketing unsafe ingredients, like tianeptine. I introduced the Prohibiting Tianeptine and Other Dangerous Products Act to get rid of tianeptine and protect consumers.",
      "edit_history_tweet_ids": [
        "2019508895593689507"
      ]
    },
    {
      "created_at": "2026-02-05T18:37:56.000Z",
      "id": "2019480628320760261",
      "text": "NEWS: The New START agreement between the U.S. and Russia just expired. For the first time in over a decade, there are no limits on U.S. and Russian nuclear arsenals. We must get back to the negotiating table and ensure safe nuclear risk reduction through enforceable limits and",
      "edit_history_tweet_ids": [
        "2019480628320760261"
      ]
    }
  ]
}