{
  "data": [
    {
      "text": "@SenJohnKennedy AND. IF YOU WANT TO PUT A DENT IN POLICE CORRUPTION. \n\nPAY THEM WHAT THEY ARE WORTH. \nSO THEY CAN  COME TO WORK AND DO WHAT THEY DREAMED TO DO. PROTECT THE INNOCENT! \n\nA BILL TO PAY ALL OUR PROTECTORS .\n\n$100,000 DOLLARS A YEAR \nMINIMUM.  \n\nAND  WATCH  \n\nGOD ALMIGHTY \n\n WORK!",
      "edit_history_tweet_ids": [
        "2019962961092350094"
      ],
      "id": "2019962961092350094",
      "created_at": "2026-02-07T02:34:33.000Z"
    },
    {
      "text": "@SenJohnKennedy Insurrection Act",
      "edit_history_tweet_ids": [
        "2019944078318649802"
      ],
      "id": "2019944078318649802",
      "created_at": "2026-02-07T01:19:31.000Z"
    },
    {
      "text": "@SenJohnKennedy Y’all need to read the Epstein files. Shows Trump, Bannon, Epstein committed treason against the USA. Also, child rape and trafficking. Punishment for treason? Death, imprisonment, disqualification from holding office. The PEOPLE demand justice for Americans and for victims.",
      "edit_history_tweet_ids": [
        "2019942733805412578"
      ],
      "id": "2019942733805412578",
      "created_at": "2026-02-07T01:14:11.000Z"
    },
    {
      "text": "@SenJohnKennedy The people ICE go after are the worst of the worst. The criminals ICE is arresting are not some mistake making type, these heinous criminals mean to make money off of us either feeding our sensitive escapists drugs, or taking their organs and babies to sell. Protect ICE.",
      "edit_history_tweet_ids": [
        "2019863054599729171"
      ],
      "id": "2019863054599729171",
      "created_at": "2026-02-06T19:57:34.000Z"
    },
    {
      "text": "@SenJohnKennedy Undercover officials work without masks every fucking day. Informants, spies, almost everyone in the intelligence community pulls it off. You’re protecting morons who shouldn’t have guns to begin with.",
      "edit_history_tweet_ids": [
        "2019834139852337528"
      ],
      "id": "2019834139852337528",
      "created_at": "2026-02-06T18:02:40.000Z"
    },
    {
      "text": "@wakanda20182022 @SenJohnKennedy I have followed you, why do you not respond?",
      "edit_history_tweet_ids": [
        "2019827363505373522"
      ],
      "id": "2019827363505373522",
      "created_at": "2026-02-06T17:35:44.000Z"
    },
    {
      "text": "@SenJohnKennedy @AriaZhang0 Who's going to stand up to him absolutely no one when we're all constantly fighting amongst one another which is the plan divided we fall united we stand. It's sad how far we have allowed the presidency to fall as Americans.",
      "edit_history_tweet_ids": [
        "2019820138309296549"
      ],
      "id": "2019820138309296549",
      "created_at": "2026-02-06T17:07:02.000Z"
    },
    {
      "text": "@SenJohnKennedy @AriaZhang0 Haven't people figured it out yet Republicans love spreading fear and misinformation to make you hate and mistrust your fellow Americans that way they can keep on doing what they've been doing rigging the system lining their pockets while simultaneously sewing the  division",
      "edit_history_tweet_ids": [
        "2019819888932733219"
      ],
      "id": "2019819888932733219",
      "created_at": "2026-02-06T17:06:02.000Z"
    },
    {
      "text": "@SenJohnKennedy @AriaZhang0 You know this is obviously not true because if it was someone would have already taken shots at the ice agent who killed that woman and then claimed he was bleeding internally obviously  lie.  we all know his identity now and nothing's happened so obviously this is a lie",
      "edit_history_tweet_ids": [
        "2019819161460130134"
      ],
      "id": "2019819161460130134",
      "created_at": "2026-02-06T17:03:09.000Z"
    },
    {
      "text": "@SenJohnKennedy And yet ICE is the only one murdering Americans in our streets.",
      "edit_history_tweet_ids": [
        "2019810087024681293"
      ],
      "id": "2019810087024681293",
      "created_at": "2026-02-06T16:27:05.000Z"
    }
  ]
}