{
  "data": [
    {
      "edit_history_tweet_ids": [
        "2019810348161962341"
      ],
      "text": "@SenJonHusted Really? This is your priority when American citizens are ruthlessly killed for peacefully practicing their 1st &amp; 2nd amendment rights; legally here immigrants (including women &amp; children) are brutally attacked; minor children have been raped by elite men? I could go on…",
      "created_at": "2026-02-06T16:28:07.000Z",
      "id": "2019810348161962341"
    },
    {
      "edit_history_tweet_ids": [
        "2019777850216243497"
      ],
      "text": "@SenJonHusted You’d think that a sitting US senator with all the major problems our country faces would have better priorities than sports. \nAfterall if you really wanted to protect women why did you vote against choice?",
      "created_at": "2026-02-06T14:18:59.000Z",
      "id": "2019777850216243497"
    },
    {
      "edit_history_tweet_ids": [
        "2019777087154880916"
      ],
      "text": "@tjames524 @SenJonHusted If you know you’re going to lose because the majority of voters are against you you have 2 choices: 1) appeal to more voters in order to get more votes or 2) use laws to limit opportunities for voters from the other side so that you can win ie cheat. The SAVE Act is the latter",
      "created_at": "2026-02-06T14:15:57.000Z",
      "id": "2019777087154880916"
    },
    {
      "edit_history_tweet_ids": [
        "2019597438496211107"
      ],
      "text": "@WeWillBeFree24 @SenJonHusted he wont he doesnt care, just look at him, lights are on but no ones home.",
      "created_at": "2026-02-06T02:22:06.000Z",
      "id": "2019597438496211107"
    },
    {
      "edit_history_tweet_ids": [
        "2019532496501895351"
      ],
      "text": "@SenJonHusted But you thought, you continue in your steadfast support of a President that “measured the children’s vagina by entering a finger and rated the children on tightness.” \n\nWould you have left Katie and Kylie alone in a room with him? https://t.co/8xLUiGZCB4",
      "created_at": "2026-02-05T22:04:02.000Z",
      "id": "2019532496501895351"
    },
    {
      "edit_history_tweet_ids": [
        "2019478428743798929"
      ],
      "text": "@SenJonHusted Pass the Save America Act please 🙏",
      "created_at": "2026-02-05T18:29:12.000Z",
      "id": "2019478428743798929"
    },
    {
      "edit_history_tweet_ids": [
        "2019449134323802274"
      ],
      "text": "@SenJonHusted Protecting girls and women starts by demanding justice for the victims of Epstein. \nPut up or shut up.",
      "created_at": "2026-02-05T16:32:47.000Z",
      "id": "2019449134323802274"
    },
    {
      "edit_history_tweet_ids": [
        "2019384897358664170"
      ],
      "text": "@SenJonHusted This is all well and good but right now is meaningless. Get LOUD and LEAD on the 2 SAVE acts, Jon. Geesh.",
      "created_at": "2026-02-05T12:17:32.000Z",
      "id": "2019384897358664170"
    },
    {
      "edit_history_tweet_ids": [
        "2019261191042769052"
      ],
      "text": "@SenJonHusted Got all your boogymen out at once tonight, eh? We are so tired of your ridiculous BS. Do your frigging job,  and address things that matter. Health care? Campaign finance reform? A balanced budget or at least not record deficits driven by crazy GOP spending? We see you clearly.",
      "created_at": "2026-02-05T04:05:58.000Z",
      "id": "2019261191042769052"
    },
    {
      "edit_history_tweet_ids": [
        "2019256710788202947"
      ],
      "text": "@SenJonHusted This is great Jon, but why are you so frivolous with our tax dollars?  Why would you vote with democrats for billions of dollars in earmarks?    Did you forget what party you caucus with?  I guess you forgot the US is $39 trillion in debt?!",
      "created_at": "2026-02-05T03:48:10.000Z",
      "id": "2019256710788202947"
    }
  ]
}