{
  "data": [
    {
      "edit_history_tweet_ids": [
        "2018408760847335902"
      ],
      "created_at": "2026-02-02T19:38:43.000Z",
      "id": "2018408760847335902",
      "text": "@JohnBoozman Constituent. The SAVE AMERICA ACT has to be signed into law. That is what getting our votes again requires. 750+ boxes from Fulton County alone and more states to go. TY"
    },
    {
      "edit_history_tweet_ids": [
        "2018371516510138694"
      ],
      "created_at": "2026-02-02T17:10:43.000Z",
      "id": "2018371516510138694",
      "text": "@JohnBoozman Please Help Iran 🙏🏻 Dictatorships don’t reform, they entrench. If the U.S. doesn’t act now and permanently eliminate the Islamic regime, Iran risks becoming the next North Korea."
    },
    {
      "edit_history_tweet_ids": [
        "2018348633779782036"
      ],
      "created_at": "2026-02-02T15:39:48.000Z",
      "id": "2018348633779782036",
      "text": "@JohnBoozman Nobody wants to hear from a worthless politician especially from ones who doesn't listen to their constituents, those days are over and you will find out come election time. I guess you forgot who you work for and what your job is. Nothing but SHAME and WEAKNESS here!"
    },
    {
      "edit_history_tweet_ids": [
        "2018345354547126780"
      ],
      "created_at": "2026-02-02T15:26:46.000Z",
      "id": "2018345354547126780",
      "text": "@JohnBoozman Why won't you respond to questions about voting to give money to refugees?  What is your stance about Tax Dollars to the Taliban?  What's your vote for the SAVE Act?"
    },
    {
      "edit_history_tweet_ids": [
        "2018339851095945611"
      ],
      "created_at": "2026-02-02T15:04:54.000Z",
      "id": "2018339851095945611",
      "text": "@JohnBoozman Arkansan here…you are suppose to support the people of Arkansas not your big donors. You are voting for illegals instead of US citizens. We are watching…"
    },
    {
      "edit_history_tweet_ids": [
        "2018328874828824881"
      ],
      "created_at": "2026-02-02T14:21:17.000Z",
      "id": "2018328874828824881",
      "text": "@JohnBoozman Blah blah blah No on is listening to  anything you say. \n\nThis is what you stand for https://t.co/9oZM3tPVfy"
    },
    {
      "edit_history_tweet_ids": [
        "2018311571772940713"
      ],
      "created_at": "2026-02-02T13:12:31.000Z",
      "id": "2018311571772940713",
      "text": "@JohnBoozman Can you explain this please? https://t.co/gOCFolmoia"
    },
    {
      "edit_history_tweet_ids": [
        "2018295677415993827"
      ],
      "created_at": "2026-02-02T12:09:22.000Z",
      "id": "2018295677415993827",
      "text": "@JohnBoozman Primary this RINO. He voted with Democrats to continue to give our money to fund African programs at a time when our country is deep in debt. Primary him and contact his office to remind him that we are watching how he votes. It is easy to find this information online."
    },
    {
      "edit_history_tweet_ids": [
        "2018293599599779964"
      ],
      "created_at": "2026-02-02T12:01:06.000Z",
      "id": "2018293599599779964",
      "text": "@JohnBoozman We are watching - your votes do not represent your constituents of which I am one. Never again will I cast my ballot for you.2028 is around the corner John. @ScottPresler can we get this guy OUT!?!"
    },
    {
      "edit_history_tweet_ids": [
        "2018287529695330509"
      ],
      "created_at": "2026-02-02T11:36:59.000Z",
      "id": "2018287529695330509",
      "text": "@JohnBoozman Very disappointed in you always voting against the American people."
    }
  ]
}