{
  "data": [
    {
      "text": "Proud to join @SenatorRisch in this legislation reiterating the importance of U.S. leadership around the world in advocating for Christians and other religious groups persecuted for their faith. https://t.co/OAAa1KGfxw",
      "edit_history_tweet_ids": [
        "2019570737082745251"
      ],
      "id": "2019570737082745251",
      "created_at": "2026-02-06T00:36:00.000Z"
    },
    {
      "text": "Dems’ demands for supporting DHS funding are unreasonable &amp; senseless.\n\nIf they limit where immigration enforcement can go, that’s where violent criminals evading arrest will flock.\n\nPreventing agents from protecting themselves makes them more vulnerable to violence &amp; threats. https://t.co/BClktLEa2P",
      "edit_history_tweet_ids": [
        "2019489220541260068"
      ],
      "id": "2019489220541260068",
      "created_at": "2026-02-05T19:12:05.000Z"
    },
    {
      "text": "https://t.co/IIj48IcmsK",
      "edit_history_tweet_ids": [
        "2019429206900503011"
      ],
      "id": "2019429206900503011",
      "created_at": "2026-02-05T15:13:36.000Z"
    },
    {
      "text": "Dems are breaking out the 2019 impeachment playbook — bold claims in the press, orchestrated by the same “whistleblower” attorney, hiding behind the cloak of classification.\n\n@SenTomCotton is right. Two IGs agree these claims aren’t credible. Predictable attacks from the Left. https://t.co/lvAw120FQD",
      "edit_history_tweet_ids": [
        "2019429204350366215"
      ],
      "id": "2019429204350366215",
      "created_at": "2026-02-05T15:13:36.000Z"
    },
    {
      "text": "Democrats need to understand that if they don’t fund DHS, they are harming FEMA, the Coast Guard, and TSA—programs that the American people depend on. https://t.co/in0pTMFWkR",
      "edit_history_tweet_ids": [
        "2019404504836317635"
      ],
      "id": "2019404504836317635",
      "created_at": "2026-02-05T13:35:27.000Z"
    },
    {
      "text": ".@POTUS has been clear—a nuclear Iran is unacceptable for America and our allies. Our goal remains peace through strength —to protect the United States and its allies without entering into endless wars. https://t.co/iNYVxCSa4i",
      "edit_history_tweet_ids": [
        "2019191346037149874"
      ],
      "id": "2019191346037149874",
      "created_at": "2026-02-04T23:28:26.000Z"
    },
    {
      "text": "Over the weekend, @ICEgov arrested an illegal alien convicted of a violent crime against a child in Whiteville.\n \nMost Americans want dangerous illegal aliens deported, but radical Dems are trying to shield these criminals by blocking funds for @DHSgov.\n\nhttps://t.co/PcAs4k3NGR",
      "edit_history_tweet_ids": [
        "2019176392068329609"
      ],
      "id": "2019176392068329609",
      "created_at": "2026-02-04T22:29:01.000Z"
    },
    {
      "text": "North Carolina will greatly benefit from the FY26 appropriations package, from revitalizing our defense industrial base to prioritizing counterdrug operations. These investments will make our state more secure and prosperous.\n\nhttps://t.co/0bnpn1jUhR",
      "edit_history_tweet_ids": [
        "2019143677998670220"
      ],
      "id": "2019143677998670220",
      "created_at": "2026-02-04T20:19:01.000Z"
    },
    {
      "edit_history_tweet_ids": [
        "2020976500338524510"
      ],
      "text": "Jimmy Lai's 20-year prison sentence is profoundly unjust. He has held fast to his faith &amp; advocated for freedom even when faced with the CCP's arbitrary imprisonment. After a two-year trial &amp; over five years in captivity, Mr. Lai &amp; his family have suffered enough. https://t.co/2w8g63AnSH",
      "id": "2020976500338524510",
      "created_at": "2026-02-09T21:42:00.000Z"
    },
    {
      "edit_history_tweet_ids": [
        "2020950921539211772"
      ],
      "text": "Given the severe storms that have impacted NC, we can’t afford coverage gaps that leave timely data unavailable. I am grateful to partner with @SenatorCantwell to ensure Americans have the information they need to keep their families safe during weather emergencies.",
      "id": "2020950921539211772",
      "created_at": "2026-02-09T20:00:21.000Z"
    }
  ]
}