{
  "data": [
    {
      "text": "My heart goes out to the Wootton High School community. We've been in close touch with local officials, and I'm grateful to the first responders for their fast action in response to this emergency.",
      "created_at": "2026-02-10T00:51:06.000Z",
      "edit_history_tweet_ids": [
        "2021024089155289510"
      ],
      "id": "2021024089155289510"
    },
    {
      "text": "Trump said he would end the war in Ukraine on Day 1.\n\nWell, it's day 385 and while Putin continues his bloody assault on Ukraine, Trump has only cozied up to Russia &amp; gotten played by Putin.\n\nHe's undermined Ukraine time and again and brought this war no closer to an end.",
      "created_at": "2026-02-09T18:45:17.000Z",
      "edit_history_tweet_ids": [
        "2020932030197047488"
      ],
      "id": "2020932030197047488"
    },
    {
      "text": "Today is a dark day for press freedom in Hong Kong. The PRC is snuffing out what was once a beacon of light. I stand in solidarity with Jimmy.\n\nThe Trump Admin must stop looking the other way &amp; enforce my Hong Kong Autonomy Act.\n\nSilence in the face of repression is unacceptable. https://t.co/pfF73wsrjd",
      "created_at": "2026-02-09T15:54:15.000Z",
      "edit_history_tweet_ids": [
        "2020888986407879052"
      ],
      "id": "2020888986407879052"
    },
    {
      "text": "The Trump Admin is still stonewalling on the Epstein Files.\n\nThey have shared survivors' identities while actively shielding the Epstein Class.\n\nThe survivors and the public deserve the WHOLE truth — not just what the DOJ wants to reveal.\n\nAccountability demands it. https://t.co/WDqjK1xxrw",
      "created_at": "2026-02-09T00:05:13.000Z",
      "edit_history_tweet_ids": [
        "2020650153103720569"
      ],
      "id": "2020650153103720569"
    },
    {
      "text": "Kash Patel stopped FBI agents from investigating Renee Good’s killing because the findings might’ve contradicted their narrative that she was a “domestic terrorist.”\n\nWe cannot trust a word coming out of this Admin.\n\nDHS must allow Minnesotan authorities to investigate, NOW. https://t.co/rZ9QOo7Epz",
      "created_at": "2026-02-08T17:35:19.000Z",
      "edit_history_tweet_ids": [
        "2020552033309274297"
      ],
      "id": "2020552033309274297"
    },
    {
      "text": "Trump said he would fight for “forgotten Americans.” I didn’t know that meant Jeff Bezos.\n\nDespite making $89.5 BILLION in profits last year, Amazon paid just 3.1% in taxes.\n\nThis is what Republicans’ SNAP &amp; Medicaid cuts were for.\n\nGuess that ‘Melania’ doc really paid off. https://t.co/dAGBTFpbZp",
      "created_at": "2026-02-06T22:02:14.000Z",
      "id": "2019894429822112026",
      "edit_history_tweet_ids": [
        "2019894429822112026"
      ]
    },
    {
      "text": "The vile video is racist. Period. And it came from a racist White House. If you can't say that, what are we doing here.",
      "created_at": "2026-02-06T17:23:48.000Z",
      "id": "2019824359259644019",
      "edit_history_tweet_ids": [
        "2019824359259644019"
      ]
    },
    {
      "text": "Our civil servants deliver critical services to the American people. But from Day 1, Trump has sought to replace a merit based system with one full of cronies.\n \nThis week, @Rep_Walkinshaw, @RepStenyHoyer &amp; I, launched the bipartisan Federal Workforce Caucus to help these https://t.co/j9uSBBD49B",
      "created_at": "2026-02-06T01:52:16.000Z",
      "id": "2019589929911586945",
      "edit_history_tweet_ids": [
        "2019589929911586945"
      ]
    },
    {
      "text": "The day after DHS agents shot Alex Pretti 10 times, Secretary Bessent suggested it was justified because Pretti had a gun holstered on his waist, which he was licensed to carry.\n\nAs the Treasury Secretary, his credibility matters. His refusal to retract his words speaks volumes. https://t.co/W1hyNh5z2N",
      "created_at": "2026-02-05T22:48:59.000Z",
      "id": "2019543806916587611",
      "edit_history_tweet_ids": [
        "2019543806916587611"
      ]
    },
    {
      "text": "Trump lied when he said he'd target “the worst of the worst.”\n\nTPS protects those who would otherwise be in grave danger. They are legally residing here &amp; contribute to our economy &amp; communities.\n\nGlad judges have halted Trump’s reckless termination of TPS for Haiti &amp; Ethiopia. https://t.co/J7qCZ8YgEL",
      "created_at": "2026-02-05T13:51:56.000Z",
      "id": "2019408654085288364",
      "edit_history_tweet_ids": [
        "2019408654085288364"
      ]
    }
  ]
}