{
  "data": [
    {
      "text": "Excited to watch @TeamUSA go for gold in Italy! Especially proud of the four New Jersey olympians, in awe of all the work and dedication it took to get to this moment.",
      "id": "2019935076658950547",
      "created_at": "2026-02-07T00:43:45.000Z",
      "edit_history_tweet_ids": [
        "2019935076658950547"
      ]
    },
    {
      "text": "Trump’s petty and pathetic decision to illegally withhold funding for Gateway is undermining union jobs, the American economy, and the safety and economic wellbeing of the hundreds of thousands of New Jerseyans that rely on this critical infrastructure every day. https://t.co/53naIwz1Tc",
      "id": "2019871647483002983",
      "created_at": "2026-02-06T20:31:42.000Z",
      "edit_history_tweet_ids": [
        "2019871647483002983"
      ]
    },
    {
      "text": "Standing with leaders from across our state this morning to fight back against Trump’s illegal attempts to stop the largest infrastructure project in the country.\nhttps://t.co/fxARJNRzzK",
      "id": "2019806222086795628",
      "created_at": "2026-02-06T16:11:44.000Z",
      "edit_history_tweet_ids": [
        "2019806222086795628"
      ]
    },
    {
      "text": "This ruling is a victory for 350,000 Haitian TPS holders, many of whom have lived and worked lawfully in New Jersey for years. Secretary Rubio, Secretary Noem, and President Trump know the dangers awaiting anyone deported to Haiti -- kidnapping, crime, terrorism, and civil unrest",
      "id": "2019522922713698425",
      "created_at": "2026-02-05T21:26:00.000Z",
      "edit_history_tweet_ids": [
        "2019522922713698425"
      ]
    },
    {
      "text": "Trump is pushing an agenda of energy scarcity. \n\nTighter supply, higher prices, and more pain for working families. https://t.co/jwHu5E63p8",
      "id": "2019443568574669022",
      "created_at": "2026-02-05T16:10:40.000Z",
      "edit_history_tweet_ids": [
        "2019443568574669022"
      ]
    },
    {
      "created_at": "2026-02-10T00:42:07.000Z",
      "id": "2021021829364858939",
      "text": "Every day millions parents put their children on a bus to go to school or activities, but they are not equipped with basic safety equipment. Honored to introduce legislation with @RepJoshG and local leaders to ensure we end these entirely preventable tragedies. https://t.co/tDY0QTBRWZ",
      "edit_history_tweet_ids": [
        "2021021829364858939"
      ]
    }
  ]
}