{
  "data": [
    {
      "id": "2017015700963930351",
      "created_at": "2026-01-29T23:23:12.000Z",
      "edit_history_tweet_ids": [
        "2017015700963930351"
      ],
      "text": "Great conversations today with Mobile Mayor Spiro Cheriogotis and Birmingham Mayor Randall Woodfin. From the Port City to the Magic City, I’m proud to be a federal partner as we work together to strengthen communities across Alabama. https://t.co/do3CUrF5tn"
    },
    {
      "id": "2016923809404633530",
      "created_at": "2026-01-29T17:18:03.000Z",
      "edit_history_tweet_ids": [
        "2016923809404633530"
      ],
      "text": "On January 29, 2025, President Trump signed the Laken Riley Act into law as the first enacted bill of his second term. One year later, more than 17,500 criminal illegal aliens have been taken off our streets under this statute. \n\nIf this commonsense law had been on the books, https://t.co/8svgQjTvmu"
    },
    {
      "id": "2016647154593329514",
      "created_at": "2026-01-28T22:58:43.000Z",
      "edit_history_tweet_ids": [
        "2016647154593329514"
      ],
      "text": "Trump Accounts are providing the next generation access to our financial markets and ultimately a pathway to their American Dream.\n\nFrom establishing these accounts to addressing the affordability and accessibility of child care in the Working Families Tax Cuts Act, we’re helping https://t.co/oSdnNAEOBQ"
    },
    {
      "id": "2016596831652712774",
      "created_at": "2026-01-28T19:38:45.000Z",
      "edit_history_tweet_ids": [
        "2016596831652712774"
      ],
      "text": ".@TrumpAccounts are all about moms and dads across Alabama and our nation being able to help build a strong future for their kids.\n\nFrom education to homeownership to starting a small business, this is a real launchpad for the next generation. https://t.co/eDVAFytCU7"
    },
    {
      "id": "2016556770018119692",
      "created_at": "2026-01-28T16:59:34.000Z",
      "edit_history_tweet_ids": [
        "2016556770018119692"
      ],
      "text": "Joining a panel soon to discuss how @TrumpAccounts will provide a strong financial foundation for our next generation. Tune in! https://t.co/HJBQ8E2yx5"
    },
    {
      "text": "Every mother deserves quality care before, during, and after pregnancy. Maternal Health Awareness Day is about raising awareness and continuing to improve outcomes for families, especially in rural and underserved areas. https://t.co/G2Nkt7AKSE",
      "edit_history_tweet_ids": [
        "2016289208462111120"
      ],
      "created_at": "2026-01-27T23:16:22.000Z",
      "id": "2016289208462111120"
    },
    {
      "edit_history_tweet_ids": [
        "2017385652195659929"
      ],
      "id": "2017385652195659929",
      "created_at": "2026-01-30T23:53:15.000Z",
      "text": "Democrats—the party of defund the police—just tried to defund ICE. Here’s what I had to say about that: https://t.co/AhlmuVXdyz"
    },
    {
      "edit_history_tweet_ids": [
        "2017267599441117469"
      ],
      "id": "2017267599441117469",
      "created_at": "2026-01-30T16:04:09.000Z",
      "text": "Don Lemon knowingly disrupted an active church service, intimidating churchgoers seeking to worship in peace and likely violating the FACE Act.\n\nHe and the other agitators should be held accountable for this cowardly ambush on people of faith. https://t.co/YprcuSgiG2"
    },
    {
      "edit_history_tweet_ids": [
        "2017260766177460498"
      ],
      "id": "2017260766177460498",
      "created_at": "2026-01-30T15:37:00.000Z",
      "text": "Radical sanctuary cities give criminal illegal aliens a safe haven at the expense of the safety and security of American citizens and our communities. Republicans won the White House, Senate, and House for a reason.  \n\nIt’s time to end sanctuary cities and states and put"
    },
    {
      "edit_history_tweet_ids": [
        "2017231172867100725"
      ],
      "id": "2017231172867100725",
      "created_at": "2026-01-30T13:39:24.000Z",
      "text": "Congratulations to Kevin Warsh on his nomination to serve as the next Chair of the Federal Reserve.\n\nKevin brings a deep expertise and proven track record in monetary policy, including years at the Federal Reserve where he helped our nation navigate some of its most economically https://t.co/ylAOO6kt3X"
    }
  ]
}