{
  "data": [
    {
      "edit_history_tweet_ids": [
        "2021543307659120666"
      ],
      "text": "@SenCapito Why did you vote against the SAVE act? Just answer that question please? We are willing to listen?",
      "id": "2021543307659120666",
      "created_at": "2026-02-11T11:14:17.000Z"
    },
    {
      "edit_history_tweet_ids": [
        "2021524680910454994"
      ],
      "text": "@SenCapito Elon put your money where your mouth is! You Flag Me As Spam People! To The World! 20 Tesla Trucks Between 2 Ramps I’ll Jump Them The Oldest Jumping Daredevil Taught By Evel &amp; Robbie Knievel! This Summer Washington DC 250th Birthday Of America! If I Make It. 250,000. Spam. lol.",
      "id": "2021524680910454994",
      "created_at": "2026-02-11T10:00:16.000Z"
    },
    {
      "edit_history_tweet_ids": [
        "2021522904236933542"
      ],
      "text": "@SenCapito Elon you Flag Me As Spam! You Say This Platform Is About Free Speech! That’s A Joke! I’m Real And pushing Nothing That ClassifiedSs Spam! What I Claim Is Fact Truth! And Will Do If Given The Opportunity Elon! Dare Me! Bring 20 Tesla Trucks Ramp To Ramp Jump This Summer DC!",
      "id": "2021522904236933542",
      "created_at": "2026-02-11T09:53:13.000Z"
    },
    {
      "edit_history_tweet_ids": [
        "2021520939578761355"
      ],
      "text": "@SenCapito Please Share! Follow on TikTok I’m Likely To Leave “X”Because Of Elon FLAGGING ME AS SPAM! I’m not! Just reaching out for support! And “X” Continues To Shut Me Down! Now The Flag As Spam I’m “The Real Deal” Super Joe Hutchinson! Oldest Distance Jumping Daredevil! Ty.🇺🇸",
      "id": "2021520939578761355",
      "created_at": "2026-02-11T09:45:24.000Z"
    },
    {
      "edit_history_tweet_ids": [
        "2021519341066604814"
      ],
      "text": "@SenCapito Watch Live On TikTok Wednesday 8 PM EST. Ask your questions, &amp; hear the details hear the facts I’m not spam even though “X.” Flagged me as Spam! I’m Truly Not! Elon Needs To Stop This! Elon States He’s Stands For Free Speech!? BS! I’m Trying To Get The Word Out “JUMP!”",
      "id": "2021519341066604814",
      "created_at": "2026-02-11T09:39:03.000Z"
    },
    {
      "edit_history_tweet_ids": [
        "2021517380669644962"
      ],
      "text": "@SenCapito I’m going to explain the mission impossible getting the word out about the world record ramp to ramp oldest distance jumping daredevil Washington DC This Summer! Watch live Wednesday 8 PM EST. Ask questions hear the details. I’m not spam. Don’t deserve “X” flagging me.",
      "id": "2021517380669644962",
      "created_at": "2026-02-11T09:31:16.000Z"
    },
    {
      "edit_history_tweet_ids": [
        "2021516274384162858"
      ],
      "text": "@SenCapito Yes Elon Red Flagged Me As Spam! No Im Not! The Senator I’ve Asked For Support! But Elon Did Have A Rough Moment With Our President Not To Long Ago! But There Are Moments Of Rush To Judgment Like Me! I’m Not Spam Remove The Flag! Daredevil Jump! Follow Me On TikTok!",
      "id": "2021516274384162858",
      "created_at": "2026-02-11T09:26:52.000Z"
    },
    {
      "edit_history_tweet_ids": [
        "2021514105644044527"
      ],
      "text": "@SenCapito Help The West Virginia Daredevil Perform In Washington DC This Summer 2026! The 250th Birthday Of America! Please Senator! Thank You! Atty. Lee Booten 304-522-4601",
      "id": "2021514105644044527",
      "created_at": "2026-02-11T09:18:15.000Z"
    },
    {
      "edit_history_tweet_ids": [
        "2021441720433639471"
      ],
      "text": "@SenCapito @SenateGOP https://t.co/tl3vFa0Qp6",
      "id": "2021441720433639471",
      "created_at": "2026-02-11T04:30:37.000Z"
    },
    {
      "edit_history_tweet_ids": [
        "2021441657036804190"
      ],
      "text": "@SenCapito @SenateGOP Time to retire",
      "id": "2021441657036804190",
      "created_at": "2026-02-11T04:30:22.000Z"
    }
  ]
}