{
  "data": [
    {
      "id": "2020869914827858204",
      "text": "@SenWarren Sit TF down, Pharmahontas.   Go back to YOUR vanity project...growing your bank account from taxpayer dollars and Big Pharma.  You're revolting.",
      "created_at": "2026-02-09T14:38:28.000Z",
      "edit_history_tweet_ids": [
        "2020869914827858204"
      ]
    },
    {
      "id": "2020866695930232864",
      "text": "@SenWarren I lost my specialist and primary thanks to Obama care. I also had my insurance premium go from 150 a month for my family to 425 for me and my 1 child. My wife is paying a separate 200 for her plan because adding her to mine is 350 more. Impeach everyone that voted for it!!",
      "created_at": "2026-02-09T14:25:40.000Z",
      "edit_history_tweet_ids": [
        "2020866695930232864"
      ]
    },
    {
      "id": "2020866562672964020",
      "text": "@smdgkd66 @RonGoldber79121 @kay_dub_h @SenWarren Members of Congress are on the ACA nincompoop. Educate your ignorant, pedophile ass.",
      "created_at": "2026-02-09T14:25:09.000Z",
      "edit_history_tweet_ids": [
        "2020866562672964020"
      ]
    },
    {
      "id": "2020865619407647060",
      "text": "@SenWarren That’s funny because going to TrumpRx I see savings of 40-50-60-70-80 percent that’s incredible for people democrats are upset because now they won’t be receiving the kickbacks from the pharmaceutical companies anymore!",
      "created_at": "2026-02-09T14:21:24.000Z",
      "edit_history_tweet_ids": [
        "2020865619407647060"
      ]
    },
    {
      "id": "2020863712358183227",
      "text": "@SenWarren Quoting  @BadaBing812 Because I won't take credit for your genius, I only appreciate it. https://t.co/ED8wLfZZ9W",
      "created_at": "2026-02-09T14:13:49.000Z",
      "edit_history_tweet_ids": [
        "2020863712358183227"
      ]
    },
    {
      "id": "2020863108353331637",
      "text": "@SenWarren Subsidies are for failed shit.  That’s all that was in the ACA.  You and every democrat who pushed that through, are responsible for the rise in healthcare.  If you really cared about lowering healthcare costs (you don’t because you need something to campaign on) you’d push for",
      "created_at": "2026-02-09T14:11:25.000Z",
      "edit_history_tweet_ids": [
        "2020863108353331637"
      ]
    },
    {
      "id": "2020862148079915374",
      "text": "@SenWarren Do you have any idea how sick and twisted you sound. This is a huge win for Americans prescription costs. Grow up. Stop lying!",
      "created_at": "2026-02-09T14:07:36.000Z",
      "edit_history_tweet_ids": [
        "2020862148079915374"
      ]
    },
    {
      "id": "2020859928294965503",
      "text": "@SenWarren Why did he kick 15 million people off of healthcare? And what are they doing today for healthcare?",
      "created_at": "2026-02-09T13:58:47.000Z",
      "edit_history_tweet_ids": [
        "2020859928294965503"
      ]
    },
    {
      "id": "2020859286214091116",
      "text": "@SenWarren Hilarious that you think Americans are too stupid to know that those extra subsides were passed and designed to expire by a 100% democrat vote. You and your ilk designed this to play out this way and the republicans just got out of the way. YOU OWN THIS!",
      "created_at": "2026-02-09T13:56:14.000Z",
      "edit_history_tweet_ids": [
        "2020859286214091116"
      ]
    },
    {
      "id": "2020857617686372601",
      "text": "@TheBarefootSage @SenWarren With the amount of money that has been fraudulently pocketed by our own government, we all qualify for a HSA.",
      "created_at": "2026-02-09T13:49:36.000Z",
      "edit_history_tweet_ids": [
        "2020857617686372601"
      ]
    }
  ]
}